doc/clamps-dictionary.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-21 Mi 11:17 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Clamps Dictionary</title>
<meta name="author" content="Orm Finnendahl" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/clamps-dictionary.css" />
<link href="./pagefind/pagefind-ui.css" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<a class="top-menu" href="../overview/index.html">Overview</a>
<a class="top-menu" href="../clamps/index.html">Clamps Packages</a>
<a class="top-menu" href="../cm-dict/index.html">CM Dictionary</a>
<a class="top-menu top-menu-active" href="./index.html">Clamps Dictionary</a>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Clamps Dictionary</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Index</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul class="ul-toc-level-1">
<li class="toc-level-1"><a href="#org3005a8c">A - B</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#orgfa00642">ats-&gt;browser</a></li>
<li class="toc-level-2"><a href="#org1ea3aae">add-sfz-preset</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#org8067787">C - D</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org68ea7df">ct2fr</a></li>
<li class="toc-level-2"><a href="#orgd419b34">clamps</a></li>
<li class="toc-level-2"><a href="#orgacaa029">clamps-base-url</a></li>
<li class="toc-level-2"><a href="#org81f5d67">clamps-restart-gui</a></li>
<li class="toc-level-2"><a href="#org3c1d1a7">clamps-gui-root</a></li>
<li class="toc-level-2"><a href="#org1abfba1">clamps-start</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#orgfcfb421">E</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org24d51ec">ensure-sfz-preset</a></li>
<li class="toc-level-2"><a href="#org3d573ca">exp-n</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#org512bfaa">F</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org3ecc4e8">ftom</a></li>
<li class="toc-level-2"><a href="#org644b9cb">fr2ct</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#org1620219">G - H</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org86aa2cb">get-sfz-preset</a></li>
<li class="toc-level-2"><a href="#org30f229f">get-val</a></li>
<li class="toc-level-2"><a href="#org08c56ec">gui</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#orgfed5abc">I - K</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org78543ac">idump</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#org5f00253">L</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org5869d83">lin-n</a></li>
<li class="toc-level-2"><a href="#org4a3a1aa">list-sfz-presets</a></li>
<li class="toc-level-2"><a href="#org9315be4">load-sfz-preset</a></li>
<li class="toc-level-2"><a href="#org789f687">logger-level</a></li>
<li class="toc-level-2"><a href="#orgc3ef1fd">lsample</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#orge3b7866">M</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org37fe3ef">m-exp</a></li>
<li class="toc-level-2"><a href="#org15d887c">m-lin</a></li>
<li class="toc-level-2"><a href="#orgd23f998">make-computed</a></li>
<li class="toc-level-2"><a href="#orgf28e231">make-ref</a></li>
<li class="toc-level-2"><a href="#orgf2bdcc6">meters</a></li>
<li class="toc-level-2"><a href="#org41aca11">mtof</a></li>
<li class="toc-level-2"><a href="#orgc14b873">msg</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#orgfed93f9">N - O</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org2bffe24">n-exp</a></li>
<li class="toc-level-2"><a href="#orgb710de9">n-exp-dev</a></li>
<li class="toc-level-2"><a href="#org892548b">n-lin</a></li>
<li class="toc-level-2"><a href="#orgee8763b">n-lin-dev</a></li>
<li class="toc-level-2"><a href="#orgc29b2b8">node-free-unprotected</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#orgb04cc01">P - Q</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org62d2892">play-sfz</a></li>
<li class="toc-level-2"><a href="#orgd08b988">play-sfz-loop</a></li>
<li class="toc-level-2"><a href="#org868f855">play-sfz-one-shot</a></li>
<li class="toc-level-2"><a href="#org419f89e">plot</a></li>
<li class="toc-level-2"><a href="#org1a5ba90">plot-2d</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#org2e3fd90">R</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org9656c03">r-elt</a></li>
<li class="toc-level-2"><a href="#orgd22c573">ref-object</a></li>
<li class="toc-level-2"><a href="#org951c3ba">remove-sfz-preset</a></li>
<li class="toc-level-2"><a href="#orgd8780c4">reset-logger-stream</a></li>
<li class="toc-level-2"><a href="#org36e3b02">rts?</a></li>
<li class="toc-level-2"><a href="#org90dfe6a">rts</a></li>
<li class="toc-level-2"><a href="#org6dbd3c6">rts-hush</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#org55f4e87">S - V</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org1ac1072">set-bpm</a></li>
<li class="toc-level-2"><a href="#org2286128">set-tempo</a></li>
<li class="toc-level-2"><a href="#orgbf5bd77">set-standard-pitch</a></li>
<li class="toc-level-2"><a href="#org4b2eaca">set-val</a></li>
<li class="toc-level-2"><a href="#orgf99d308">sfz</a></li>
<li class="toc-level-2"><a href="#orgbb9b648">sfz-amplitude</a></li>
<li class="toc-level-2"><a href="#org5accb28">sfz-chan</a></li>
<li class="toc-level-2"><a href="#org0133edc">sfz-duration</a></li>
<li class="toc-level-2"><a href="#org7191415">sfz-get-range</a></li>
<li class="toc-level-2"><a href="#org6f2e6c0">sfz-keynum</a></li>
<li class="toc-level-2"><a href="#orgc0e83d7">sfz-pan</a></li>
<li class="toc-level-2"><a href="#org3f64d52">sfz-preset-file</a></li>
<li class="toc-level-2"><a href="#org01b0ffb">sfz-preset-loaded?</a></li>
<li class="toc-level-2"><a href="#org20ee4a6">sfz-play-fn</a></li>
<li class="toc-level-2"><a href="#org4973f5f">sfz-preset</a></li>
<li class="toc-level-2"><a href="#orgc115799">sfz-startpos</a></li>
<li class="toc-level-2"><a href="#org4ee3faa">&lowast;standard-pitch&lowast;</a></li>
<li class="toc-level-2"><a href="#org669127c">start-doc-acceptor</a></li>
<li class="toc-level-2"><a href="#org6599126">svg</a></li>
<li class="toc-level-2"><a href="#orge98d1d5">svg-&gt;browser</a></li>
<li class="toc-level-2"><a href="#orgf2ea187">svg-gui-path</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#orgf1e5cfb">W - Z</a>
<ul class="ul-toc-level-2">
<li class="toc-level-2"><a href="#org1d9cbb3">watch</a></li>
</ul>
</li>
<li class="toc-level-1"><a href="#org8dde590"><span class="todo TODO">TODO</span> </a></li>
</ul>
</div>
</nav>
<pre class="example">
export-dict-to-clamps
</pre>
<div id="outline-container-org3005a8c" class="outline-2">
<h2 id="org3005a8c">A - B</h2>
<div class="outline-text-2" id="text-org3005a8c">
</div>
<div id="outline-container-orgfa00642" class="outline-3">
<h3 id="orgfa00642">ats-&gt;browser</h3>
<div class="outline-text-3" id="text-orgfa00642">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>ats-&gt;browser ats<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Display the ats struct <code>ats</code> graphically in the interactive ATS
Player located at <i>&lt;clamps-base-url&gt;/ats-display</i> in the Gui.
</p>
</div>
<div id="outline-container-orgd6142ee" class="outline-4">
<h4 id="orgd6142ee">Arguments</h4>
<div class="outline-text-4" id="text-orgd6142ee">
<p>
<code>ats</code> The ats struct to display.
</p>
</div>
</div>
<div id="outline-container-org12c816c" class="outline-4">
<h4 id="org12c816c">See also</h4>
<div class="outline-text-4" id="text-org12c816c">
<ul class="org-ul">
<li><a href="#orgacaa029">clamps-base-url</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1ea3aae" class="outline-3">
<h3 id="org1ea3aae">add-sfz-preset</h3>
<div class="outline-text-3" id="text-org1ea3aae">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>add-sfz-preset preset file<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Register the association between a preset name and its corresponding sfz
file.
</p>
</div>
<div id="outline-container-org29f3b71" class="outline-4">
<h4 id="org29f3b71">Arguments</h4>
<div class="outline-text-4" id="text-org29f3b71">
<p>
<code>preset</code> A keyword or symbol to name the preset
</p>

<p>
<code>file</code> A string or path to the associated sfz file. If the file
path is relative, it will be searched recursively in all paths of
<i>cl-user::*sfz-file-path*</i>.
</p>
</div>
</div>
<div id="outline-container-orga3af71f" class="outline-4">
<h4 id="orga3af71f">Note:</h4>
<div class="outline-text-4" id="text-orga3af71f">
<p>
This function only stores the association between the preset name
and its sfz file. Loading of its samples into memory is done
implicitely when the preset is used by a playing function like
<a href="#org62d2892">play-sfz</a> or by using <a href="#org24d51ec">ensure-sfz-preset</a> or its synonym
<a href="#org86aa2cb">get-sfz-preset</a>.
</p>
</div>
</div>
<div id="outline-container-org424e4e6" class="outline-4">
<h4 id="org424e4e6">See also</h4>
<div class="outline-text-4" id="text-org424e4e6">
<ul class="org-ul">
<li><a href="#org24d51ec">ensure-sfz-preset</a></li>

<li><a href="#org86aa2cb">get-sfz-preset</a></li>

<li><a href="#orgf99d308">sfz</a></li>

<li><a href="#org01b0ffb">sfz-preset-loaded?</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org8067787" class="outline-2">
<h2 id="org8067787">C - D</h2>
<div class="outline-text-2" id="text-org8067787">
</div>
<div id="outline-container-org68ea7df" class="outline-3">
<h3 id="org68ea7df">ct2fr</h3>
<div class="outline-text-3" id="text-org68ea7df">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>ct2fr cent<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the frequency ratio of the Midicents interval <i>cent</i>.
</p>
</div>
<div id="outline-container-orgcb3c76b" class="outline-4">
<h4 id="orgcb3c76b">Arguments</h4>
<div class="outline-text-4" id="text-orgcb3c76b">
<p>
<code>cent</code> The interval in Midicents.
</p>
</div>
</div>
