doc/clamps-dictionary.org
*** Example
    #+BEGIN_SRC lisp
      (ct2fr 12) ;; => 2

      (ct2fr 1) ;; => 1.0594631

      (ct2fr 7) ;; => 1.4983071

      (ct2fr -12) ;; => 1/2
    #+END_SRC
*** See also
    - [[fr2ct][fr2ct]]
** clamps
   Function
   #+BEGIN_SRC lisp
     (clamps &key (gui-root "/tmp/") (open t))
   #+END_SRC
   Start Clamps including the gui.

   Besides starting the Gui the function also:

   - Starts the osc responder for Inkscape.
   - Starts the realtime engine calling [[rts][rts]].
   - Creates groups and buses for incudine dsps (see the
     Chapter [[clamps:General Incudine
      Setup][General Incudine Setup]] in [[../clamps/index.html][Clamps Packages]]).
   - Starts the documentation acceptor for the searchable online doc
     at /[[http://localhost:8282/overview/index.html]]/.

*** Arguments
   =gui-root= ist the path where to put the /www/ subfolder for files
   accessible by the gui (nicknamed /<clamps-gui-root>/ throughout
   this dictionary).

   =open= is a flag indicating whether to open the [[clamps-base-url][clamps-base-url]] in
   a browser window after starting the gui.
   
   In the given path the following directories
   will be created:

   - /<clamps-gui-root>/www//
   - /<clamps-gui-root>/www/svg//
     
     file path for svg files used in the /<clamps-base-url>/svg-display/ page
     of the Gui.

   Any files which need to be accessible by the Gui have to be put
   into the /<clamps-gui-root>/www// subdirectory with their filenames
   relative to this directory.
   
*** See also
    - [[clamps-base-url][clamps-base-url]]
    - [[clamps-restart-gui][clamps-restart-gui]]
    - [[clamps-gui-root][clamps-gui-root]]
** clamps-base-url
   Function
   #+BEGIN_SRC lisp
     (clamps-base-url)
   #+END_SRC
   Return the base url to access the Clamps Gui (nicknamed /<clamps-base-url>/ in this
   dictionary).

   Its default location is http://localhost:54619.

   /<clamps-base-url>/ in the browser side is corresponding to the
   path /<clamps-gui-root>/, so an address named
   /<clamps-base-url>/<file>/ will load the file located at
   /<clamps-gui-root>/<file>/ as HTML into the browser window.
*** Example

    The location for the [[svg->browser][SVG Player Gui]] is at
    /<clamps-base-url>/svg-display/ which translates to the URL

    [[http://localhost:54619/svg-display]]

*** See also
    - [[clamps][clamps]]
    - [[clamps-restart-gui][clamps-restart-gui]]
    - [[clamps-gui-root][clamps-gui-root]]
    - [[gui][gui]]
    - [[meters][meters]]
** clamps-restart-gui
   Function
   #+BEGIN_SRC lisp
     (clamps-restart-gui gui-root &key (open t))
   #+END_SRC
   Reset the root directory of the Gui to /gui-root/www/, optionally
   opening the Gui in a browser window.
*** Arguments
    =gui-root= ist the path where to put the /www/ subfolder for files
    accessible by the gui (nicknamed /<clamps-gui-root>/ throughout
    this dictionary).

    =:open= is a flag indicating whether to open [[clamps-base-url][clamps-base-url]] in a
    browser window after starting the gui.
   
    In the given path the following directories
    will be created:

    - /<clamps-gui-root>/www//
    - /<clamps-gui-root>/www/svg//
     
      file path for svg files used in the /svg-display/ page of the
      Gui.

    Any files which need to be accessible by the Gui have to be put
    into the /<clamps-gui-root>/www// subdirectory with their filenames
    relative to this directory.
*** See also
    - [[clamps][clamps]]
    - [[clamps-base-url][clamps-base-url]]
    - [[clamps-gui-root][clamps-gui-root]]
** clamps-gui-root
   Function
   #+BEGIN_SRC lisp
     (clamps-gui-root)
   #+END_SRC
   Return the pathname of the Gui root directory. It is nicknamed
   /<clamps-gui-root>/ throughout this dictionary.

   /<clamps-gui-root>/ is the path corresponding to
   /<clamps-base-url>/ on the browser side, so any file named /<file>/
   put into the /<clamps-gui-root>/ directory can be accessed in the
   browser at the address /<clamps-base-url>/<file>/.
*** See also
    - [[clamps][clamps]]
    - [[clamps-base-url][clamps-base-url]]
    - [[clamps-restart-gui][clamps-restart-gui]]
** clamps-start
Function
   #+Begin_src lisp
     (clamps-start &key (gui-root "/tmp") (qsynth nil) (open-gui nil))
   #+End_src
   Start clamps, optionally starting qsynth (Linux only) and opening
   the gui in a browser. This function gets called by [[clamps][clamps]] and
   should normally not be called by the user.
*** Arguments
    =gui-root= The root path of the gui
    
    =qsynth= Boolean indicating whether to start the qsynth softsynth (Linux only).
    
    =open-gui= Boolean indicating whether to open the gui in a Browser window.
*** See also
    - [[clamps-gui-root][clamps-gui-root]]
* E
** ensure-sfz-preset
   Function
   #+BEGIN_SRC lisp
     (ensure-sfz-preset preset &key force (play-fn #'play-sfz-loop))
   #+END_SRC

   Synonym of [[get-sfz-preset][get-sfz-preset]].
