doc/clamps-dictionary.html
<div id="outline-container-org2b8e56d" class="outline-4">
<h4 id="org2b8e56d">Example</h4>
<div class="outline-text-4" id="text-org2b8e56d">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>ct2fr 12<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; 2</span>

<span style="color: #ffff00;">(</span>ct2fr 1<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; 1.0594631</span>

<span style="color: #ffff00;">(</span>ct2fr 7<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; 1.4983071</span>

<span style="color: #ffff00;">(</span>ct2fr -12<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; 1/2</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgec58ea6" class="outline-4">
<h4 id="orgec58ea6">See also</h4>
<div class="outline-text-4" id="text-orgec58ea6">
<ul class="org-ul">
<li><a href="#org644b9cb">fr2ct</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd419b34" class="outline-3">
<h3 id="orgd419b34">clamps</h3>
<div class="outline-text-3" id="text-orgd419b34">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>clamps <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>gui-root <span style="color: #87cefa;">"/tmp/"</span><span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>open t<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Start Clamps including the gui.
</p>

<p>
Besides starting the Gui the function also:
</p>

<ul class="org-ul">
<li>Starts the osc responder for Inkscape.</li>
<li>Starts the realtime engine calling <a href="#org90dfe6a">rts</a>.</li>
<li>Creates groups and buses for incudine dsps (see the
Chapter <a href="../nil">General Incudine Setup</a> in <a href="../clamps/index.html">Clamps Packages</a>).</li>
<li>Starts the documentation acceptor for the searchable online doc
at <i><a href="http://localhost:8282/overview/index.html">http://localhost:8282/overview/index.html</a></i>.</li>
</ul>
</div>
<div id="outline-container-org303c491" class="outline-4">
<h4 id="org303c491">Arguments</h4>
<div class="outline-text-4" id="text-org303c491">
<p>
<code>gui-root</code> ist the path where to put the <i>www</i> subfolder for files
accessible by the gui (nicknamed <i>&lt;clamps-gui-root&gt;</i> throughout
this dictionary).
</p>

<p>
<code>open</code> is a flag indicating whether to open the <a href="#orgacaa029">clamps-base-url</a> in
a browser window after starting the gui.
</p>

<p>
In the given path the following directories
will be created:
</p>

<ul class="org-ul">
<li><i>&lt;clamps-gui-root&gt;/www/</i></li>
<li><p>
<i>&lt;clamps-gui-root&gt;/www/svg/</i>
</p>

<p>
file path for svg files used in the <i>&lt;clamps-base-url&gt;/svg-display</i> page
of the Gui.
</p></li>
</ul>

<p>
Any files which need to be accessible by the Gui have to be put
into the <i>&lt;clamps-gui-root&gt;/www/</i> subdirectory with their filenames
relative to this directory.
</p>
</div>
</div>
<div id="outline-container-org4b36a81" class="outline-4">
<h4 id="org4b36a81">See also</h4>
<div class="outline-text-4" id="text-org4b36a81">
<ul class="org-ul">
<li><a href="#orgacaa029">clamps-base-url</a></li>
<li><a href="#org81f5d67">clamps-restart-gui</a></li>
<li><a href="#org3c1d1a7">clamps-gui-root</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgacaa029" class="outline-3">
<h3 id="orgacaa029">clamps-base-url</h3>
<div class="outline-text-3" id="text-orgacaa029">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>clamps-base-url<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the base url to access the Clamps Gui (nicknamed <i>&lt;clamps-base-url&gt;</i> in this
dictionary).
</p>

<p>
Its default location is <a href="http://localhost:54619">http://localhost:54619</a>.
</p>

<p>
<i>&lt;clamps-base-url&gt;</i> in the browser side is corresponding to the
path <i>&lt;clamps-gui-root&gt;</i>, so an address named
<i>&lt;clamps-base-url&gt;/&lt;file&gt;</i> will load the file located at
<i>&lt;clamps-gui-root&gt;/&lt;file&gt;</i> as HTML into the browser window.
</p>
</div>
<div id="outline-container-org170c7db" class="outline-4">
<h4 id="org170c7db">Example</h4>
<div class="outline-text-4" id="text-org170c7db">
<p>
The location for the <a href="#orge98d1d5">SVG Player Gui</a> is at
<i>&lt;clamps-base-url&gt;/svg-display</i> which translates to the URL
</p>

<p>
<a href="http://localhost:54619/svg-display">http://localhost:54619/svg-display</a>
</p>
</div>
</div>
<div id="outline-container-org917784d" class="outline-4">
<h4 id="org917784d">See also</h4>
<div class="outline-text-4" id="text-org917784d">
<ul class="org-ul">
<li><a href="#orgd419b34">clamps</a></li>
<li><a href="#org81f5d67">clamps-restart-gui</a></li>
<li><a href="#org3c1d1a7">clamps-gui-root</a></li>
<li><a href="#org08c56ec">gui</a></li>
<li><a href="#orgf2bdcc6">meters</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org81f5d67" class="outline-3">
<h3 id="org81f5d67">clamps-restart-gui</h3>
<div class="outline-text-3" id="text-org81f5d67">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>clamps-restart-gui gui-root <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>open t<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Reset the root directory of the Gui to <i>gui-root/www</i>, optionally
opening the Gui in a browser window.
</p>
</div>
<div id="outline-container-org55cf14c" class="outline-4">
<h4 id="org55cf14c">Arguments</h4>
<div class="outline-text-4" id="text-org55cf14c">
<p>
<code>gui-root</code> ist the path where to put the <i>www</i> subfolder for files
accessible by the gui (nicknamed <i>&lt;clamps-gui-root&gt;</i> throughout
this dictionary).
</p>

<p>
<code>:open</code> is a flag indicating whether to open <a href="#orgacaa029">clamps-base-url</a> in a
browser window after starting the gui.
</p>

<p>
In the given path the following directories
will be created:
</p>

<ul class="org-ul">
<li><i>&lt;clamps-gui-root&gt;/www/</i></li>
<li><p>
<i>&lt;clamps-gui-root&gt;/www/svg/</i>
</p>

<p>
file path for svg files used in the <i>svg-display</i> page of the
Gui.
</p></li>
</ul>

<p>
Any files which need to be accessible by the Gui have to be put
into the <i>&lt;clamps-gui-root&gt;/www/</i> subdirectory with their filenames
relative to this directory.
</p>
</div>
</div>
<div id="outline-container-org2150c81" class="outline-4">
<h4 id="org2150c81">See also</h4>
<div class="outline-text-4" id="text-org2150c81">
<ul class="org-ul">
<li><a href="#orgd419b34">clamps</a></li>
<li><a href="#orgacaa029">clamps-base-url</a></li>
<li><a href="#org3c1d1a7">clamps-gui-root</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3c1d1a7" class="outline-3">
<h3 id="org3c1d1a7">clamps-gui-root</h3>
<div class="outline-text-3" id="text-org3c1d1a7">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>clamps-gui-root<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the pathname of the Gui root directory. It is nicknamed
<i>&lt;clamps-gui-root&gt;</i> throughout this dictionary.
</p>

<p>
<i>&lt;clamps-gui-root&gt;</i> is the path corresponding to
<i>&lt;clamps-base-url&gt;</i> on the browser side, so any file named <i>&lt;file&gt;</i>
put into the <i>&lt;clamps-gui-root&gt;</i> directory can be accessed in the
browser at the address <i>&lt;clamps-base-url&gt;/&lt;file&gt;</i>.
</p>
</div>
<div id="outline-container-org4d5fd6f" class="outline-4">
<h4 id="org4d5fd6f">See also</h4>
<div class="outline-text-4" id="text-org4d5fd6f">
<ul class="org-ul">
<li><a href="#orgd419b34">clamps</a></li>
<li><a href="#orgacaa029">clamps-base-url</a></li>
<li><a href="#org81f5d67">clamps-restart-gui</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1abfba1" class="outline-3">
<h3 id="org1abfba1">clamps-start</h3>
<div class="outline-text-3" id="text-org1abfba1">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>clamps-start <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>gui-root <span style="color: #87cefa;">"/tmp"</span><span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>qsynth nil<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>open-gui nil<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Start clamps, optionally starting qsynth (Linux only) and opening
the gui in a browser. This function gets called by <a href="#orgd419b34">clamps</a> and
should normally not be called by the user.
</p>
</div>
<div id="outline-container-orgbd71b9c" class="outline-4">
<h4 id="orgbd71b9c">Arguments</h4>
<div class="outline-text-4" id="text-orgbd71b9c">
<p>
<code>gui-root</code> The root path of the gui
</p>

<p>
<code>qsynth</code> Boolean indicating whether to start the qsynth softsynth (Linux only).
</p>

<p>
<code>open-gui</code> Boolean indicating whether to open the gui in a Browser window.
</p>
</div>
</div>
<div id="outline-container-org852bf34" class="outline-4">
<h4 id="org852bf34">See also</h4>
<div class="outline-text-4" id="text-org852bf34">
<ul class="org-ul">
<li><a href="#org3c1d1a7">clamps-gui-root</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfcfb421" class="outline-2">
<h2 id="orgfcfb421">E</h2>
<div class="outline-text-2" id="text-orgfcfb421">
</div>
<div id="outline-container-org24d51ec" class="outline-3">
<h3 id="org24d51ec">ensure-sfz-preset</h3>
<div class="outline-text-3" id="text-org24d51ec">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>ensure-sfz-preset preset <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> force <span style="color: #a9a9a9;">(</span>play-fn #'play-sfz-loop<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>

<p>
Synonym of <a href="#org86aa2cb">get-sfz-preset</a>.
</p>
</div>
</div>
