doc/clamps-dictionary.org
** exp-n
   Function
   #+BEGIN_SRC lisp
     (exp-n x min max)
   #+END_SRC
   Return the reverse linear interpolation for a value in the range
   /[min..max]/ as a normalized float value. /Min/ and /max/ have to be
   positive numbers.
*** Arguments
    =x= An input value in the range /[min..max]/ to be interpolated.
    
    =min= The minimum value.

    =max= The maximum value.
*** Examples
    #+BEGIN_SRC lisp
      (exp-n 1 1 100) ; => 0.0

      (exp-n 10 1 100) ; => 0.5

      (exp-n 100 1 100) ; => 1.0
    #+END_SRC
*** See also
    - [[lin-n][lin-n]]

    - [[m-exp][m-exp]]

    - [[m-lin][m-lin]]
    
    - [[n-exp][n-exp]]

    - [[n-exp-dev][n-exp-dev]]

    - [[n-lin][n-lin]]

    - [[n-lin-dev][n-lin-dev]]
* F
** ftom
   Function
   #+BEGIN_SRC lisp
     (ftom freq &key (tuning-base *standard-pitch*))
   #+END_SRC
   Convert frequency in Hz to pitch in Midicents.
*** Arguments
   =freq= Frequency in Hz.

   =:tuning-base= Frequency of A4 in Hz.
*** Examples
    #+BEGIN_SRC lisp
      (ftom 440) ; => 69.0

      (ftom 269.3) ; => 60.500526

      (ftom 415 :tuning-base 415) ; => 69.0
    #+END_SRC

*** See also
    - [[mtof][mtof]]
** fr2ct
   Function
   #+BEGIN_SRC lisp
     (fr2ct ratio)
   #+END_SRC
   Return the Midicents interval of /ratio/.
*** Arguments
    =ratio= The frequency ratio of the interval.
*** Example
#+BEGIN_SRC lisp
  (fr2ct 2) ;; => 12.0

  (fr2ct 4/5) ;; => -3.863137

  (fr2ct 3/2) ;; => 7.01955

  (fr2ct 1/2) ;; => -12.0
#+END_SRC
*** See also
    - [[ct2fr][ct2fr]]
* G - H
** get-sfz-preset
   Function
   #+BEGIN_SRC lisp
     (get-sfz-preset preset &key force (play-fn #'play-sfz-loop))
   #+END_SRC

   Load the sfz definition of /preset/ and all its samples into the
   system if it hasn't been loaded previously. If force is /t/, force
   reload. Optionally set a play function.

   The association between the preset name and its sfz file has to be
   established before using [[add-sfz-preset][add-sfz-preset]], otherwise a warning is
   issued and no file is loaded.

*** Arguments
    =preset= A keynum or symbol to serve as a name of the preset.

    =:force= A boolean indicating to force a reload even if the preset
    has been loaded before.

    =:play-fn= The play function to be used. Possible options are:

      - [[play-sfz-loop][#'play-sfz-loop]]

      - [[play-sfz-one-shot][#'play-sfz-one-shot]]
*** See also
    - [[add-sfz-preset][add-sfz-preset]]

    - [[ensure-sfz-preset][ensure-sfz-preset]]

    - [[load-sfz-preset][load-sfz-preset]]

    - [[remove-sfz-preset][remove-sfz-preset]]

    - [[sfz-preset-loaded?][sfz-preset-loaded?]]
** get-val
   Function
   #+BEGIN_SRC lisp
     (get-val ref-object)
   #+END_SRC
   Return the value of /ref-object/.
*** Arguments
    =ref-object= An instance of [[ref-object][ref-object]].
*** See also
    - [[make-computed][make-computed]]

    - [[make-ref][make-ref]]

    - [[set-val][set-val]]

    - [[watch][watch]]
** gui
   Function
   #+BEGIN_SRC lisp
     (gui)
   #+END_SRC
   Open the page at /<clamps-base-url>/ in a Browser.
*** See also
    - [[clamps-base-url][clamps-base-url]]
    - [[meters][meters]]
* I - K
** idump
   Function
   #+BEGIN_SRC lisp
     (idump node)
   #+END_SRC
   Dump all active dsps of /node/ to the /incudine:\ast{}logger-stream\ast{}/
   output.

*** Arguments
    - =node= The id of the node
*** Note:
    If /(idump)/ doesn't create any output although dsps are running,
    reset the logger-stream using [[reset-logger-stream][reset-logger-stream]].
* L
** lin-n
   Function
   #+BEGIN_SRC lisp
     (lin-n x min max)
   #+END_SRC
   Return the reverse linear interpolation for a value in the range
   /[min..max]/ as a normalized float value.
*** Arguments
    =x= An input value in the range /[min..max]/ to be interpolated.
    
    =min= The minimum value.

    =max= The maximum value.
*** Examples
    #+BEGIN_SRC lisp
      (lin-n 10 10 20) ; => 0.0

      (lin-n 15 10 20) ; => 0.5

      (lin-n 20 10 20) ; => 1.0
    #+END_SRC
*** See also
    - [[exp-n][exp-n]]

    - [[m-exp][m-exp]]

    - [[m-lin][m-lin]]
    
    - [[n-exp][n-exp]]

    - [[n-exp-dev][n-exp-dev]]

    - [[n-lin][n-lin]]

    - [[n-lin-dev][n-lin-dev]]
