doc/clamps-dictionary.html
<div id="outline-container-org3d573ca" class="outline-3">
<h3 id="org3d573ca">exp-n</h3>
<div class="outline-text-3" id="text-org3d573ca">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>exp-n x min max<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the reverse linear interpolation for a value in the range
<i>[min..max]</i> as a normalized float value. <i>Min</i> and <i>max</i> have to be
positive numbers.
</p>
</div>
<div id="outline-container-orgbef6c73" class="outline-4">
<h4 id="orgbef6c73">Arguments</h4>
<div class="outline-text-4" id="text-orgbef6c73">
<p>
<code>x</code> An input value in the range <i>[min..max]</i> to be interpolated.
</p>

<p>
<code>min</code> The minimum value.
</p>

<p>
<code>max</code> The maximum value.
</p>
</div>
</div>
<div id="outline-container-org53a9ca8" class="outline-4">
<h4 id="org53a9ca8">Examples</h4>
<div class="outline-text-4" id="text-org53a9ca8">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>exp-n 1 1 100<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 0.0</span>

<span style="color: #ffff00;">(</span>exp-n 10 1 100<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 0.5</span>

<span style="color: #ffff00;">(</span>exp-n 100 1 100<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 1.0</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaa0d295" class="outline-4">
<h4 id="orgaa0d295">See also</h4>
<div class="outline-text-4" id="text-orgaa0d295">
<ul class="org-ul">
<li><a href="#org5869d83">lin-n</a></li>

<li><a href="#org37fe3ef">m-exp</a></li>

<li><a href="#org15d887c">m-lin</a></li>

<li><a href="#org2bffe24">n-exp</a></li>

<li><a href="#orgb710de9">n-exp-dev</a></li>

<li><a href="#org892548b">n-lin</a></li>

<li><a href="#orgee8763b">n-lin-dev</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org512bfaa" class="outline-2">
<h2 id="org512bfaa">F</h2>
<div class="outline-text-2" id="text-org512bfaa">
</div>
<div id="outline-container-org3ecc4e8" class="outline-3">
<h3 id="org3ecc4e8">ftom</h3>
<div class="outline-text-3" id="text-org3ecc4e8">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>ftom freq <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>tuning-base *standard-pitch*<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Convert frequency in Hz to pitch in Midicents.
</p>
</div>
<div id="outline-container-org298abfa" class="outline-4">
<h4 id="org298abfa">Arguments</h4>
<div class="outline-text-4" id="text-org298abfa">
<p>
<code>freq</code> Frequency in Hz.
</p>

<p>
<code>:tuning-base</code> Frequency of A4 in Hz.
</p>
</div>
</div>
<div id="outline-container-orgb8991e3" class="outline-4">
<h4 id="orgb8991e3">Examples</h4>
<div class="outline-text-4" id="text-orgb8991e3">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>ftom 440<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 69.0</span>

<span style="color: #ffff00;">(</span>ftom 269.3<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 60.500526</span>

<span style="color: #ffff00;">(</span>ftom 415 <span style="color: #7fffd4;">:tuning-base</span> 415<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 69.0</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org97efa86" class="outline-4">
<h4 id="org97efa86">See also</h4>
<div class="outline-text-4" id="text-org97efa86">
<ul class="org-ul">
<li><a href="#org41aca11">mtof</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org644b9cb" class="outline-3">
<h3 id="org644b9cb">fr2ct</h3>
<div class="outline-text-3" id="text-org644b9cb">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>fr2ct ratio<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the Midicents interval of <i>ratio</i>.
</p>
</div>
<div id="outline-container-org567ffb7" class="outline-4">
<h4 id="org567ffb7">Arguments</h4>
<div class="outline-text-4" id="text-org567ffb7">
<p>
<code>ratio</code> The frequency ratio of the interval.
</p>
</div>
</div>
<div id="outline-container-org1ae4350" class="outline-4">
<h4 id="org1ae4350">Example</h4>
<div class="outline-text-4" id="text-org1ae4350">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>fr2ct 2<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; 12.0</span>

<span style="color: #ffff00;">(</span>fr2ct 4/5<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; -3.863137</span>

<span style="color: #ffff00;">(</span>fr2ct 3/2<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; 7.01955</span>

<span style="color: #ffff00;">(</span>fr2ct 1/2<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; -12.0</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org18f0978" class="outline-4">
<h4 id="org18f0978">See also</h4>
<div class="outline-text-4" id="text-org18f0978">
<ul class="org-ul">
<li><a href="#org68ea7df">ct2fr</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org1620219" class="outline-2">
<h2 id="org1620219">G - H</h2>
<div class="outline-text-2" id="text-org1620219">
</div>
<div id="outline-container-org86aa2cb" class="outline-3">
<h3 id="org86aa2cb">get-sfz-preset</h3>
<div class="outline-text-3" id="text-org86aa2cb">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>get-sfz-preset preset <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> force <span style="color: #a9a9a9;">(</span>play-fn #'play-sfz-loop<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>

<p>
Load the sfz definition of <i>preset</i> and all its samples into the
system if it hasn't been loaded previously. If force is <i>t</i>, force
reload. Optionally set a play function.
</p>

<p>
The association between the preset name and its sfz file has to be
established before using <a href="#org1ea3aae">add-sfz-preset</a>, otherwise a warning is
issued and no file is loaded.
</p>
</div>
<div id="outline-container-orgcd26a17" class="outline-4">
<h4 id="orgcd26a17">Arguments</h4>
<div class="outline-text-4" id="text-orgcd26a17">
<p>
<code>preset</code> A keynum or symbol to serve as a name of the preset.
</p>

<p>
<code>:force</code> A boolean indicating to force a reload even if the preset
has been loaded before.
</p>

<p>
<code>:play-fn</code> The play function to be used. Possible options are:
</p>

<ul class="org-ul">
<li><a href="#orgd08b988">#'play-sfz-loop</a></li>

<li><a href="#org868f855">#'play-sfz-one-shot</a></li>
</ul>
</div>
</div>
<div id="outline-container-org08c5e8c" class="outline-4">
<h4 id="org08c5e8c">See also</h4>
<div class="outline-text-4" id="text-org08c5e8c">
<ul class="org-ul">
<li><a href="#org1ea3aae">add-sfz-preset</a></li>

<li><a href="#org24d51ec">ensure-sfz-preset</a></li>

<li><a href="#org9315be4">load-sfz-preset</a></li>

<li><a href="#org951c3ba">remove-sfz-preset</a></li>

<li><a href="#org01b0ffb">sfz-preset-loaded?</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org30f229f" class="outline-3">
<h3 id="org30f229f">get-val</h3>
<div class="outline-text-3" id="text-org30f229f">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>get-val ref-object<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the value of <i>ref-object</i>.
</p>
</div>
<div id="outline-container-org5101673" class="outline-4">
<h4 id="org5101673">Arguments</h4>
<div class="outline-text-4" id="text-org5101673">
<p>
<code>ref-object</code> An instance of <a href="#orgd22c573">ref-object</a>.
</p>
</div>
</div>
<div id="outline-container-orgc260b6e" class="outline-4">
<h4 id="orgc260b6e">See also</h4>
<div class="outline-text-4" id="text-orgc260b6e">
<ul class="org-ul">
<li><a href="#orgd23f998">make-computed</a></li>

<li><a href="#orgf28e231">make-ref</a></li>

<li><a href="#org4b2eaca">set-val</a></li>

<li><a href="#org1d9cbb3">watch</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org08c56ec" class="outline-3">
<h3 id="org08c56ec">gui</h3>
<div class="outline-text-3" id="text-org08c56ec">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>gui<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Open the page at <i>&lt;clamps-base-url&gt;</i> in a Browser.
</p>
</div>
<div id="outline-container-orgf771320" class="outline-4">
<h4 id="orgf771320">See also</h4>
<div class="outline-text-4" id="text-orgf771320">
<ul class="org-ul">
<li><a href="#orgacaa029">clamps-base-url</a></li>
<li><a href="#orgf2bdcc6">meters</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfed5abc" class="outline-2">
<h2 id="orgfed5abc">I - K</h2>
<div class="outline-text-2" id="text-orgfed5abc">
</div>
<div id="outline-container-org78543ac" class="outline-3">
<h3 id="org78543ac">idump</h3>
<div class="outline-text-3" id="text-org78543ac">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>idump node<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Dump all active dsps of <i>node</i> to the <i>incudine:&lowast;logger-stream&lowast;</i>
output.
</p>
</div>
<div id="outline-container-org6b9bf3d" class="outline-4">
<h4 id="org6b9bf3d">Arguments</h4>
<div class="outline-text-4" id="text-org6b9bf3d">
<ul class="org-ul">
<li><code>node</code> The id of the node</li>
</ul>
</div>
</div>
<div id="outline-container-org28675e5" class="outline-4">
<h4 id="org28675e5">Note:</h4>
<div class="outline-text-4" id="text-org28675e5">
<p>
If <i>(idump)</i> doesn't create any output although dsps are running,
reset the logger-stream using <a href="#orgd8780c4">reset-logger-stream</a>.
</p>
</div>
</div>
</div>
</div>
