doc/clamps-dictionary.org
** list-sfz-presets
   Function
   #+BEGIN_SRC lisp
     (list-sfz-presets &key (loaded nil))
   #+END_SRC
   Return a sorted list of all sfz preset names.
*** Arguments
    =:loaded= Boolean to indicate whether only the preset names of
    loaded presets should be returned. If /nil/ all registered preset
    names are returned.
** load-sfz-preset
   Function
   #+BEGIN_SRC lisp
     (load-sfz-preset file name &key force (play-fn #'play-sfz-loop))
   #+END_SRC

   Load a sfz file into a preset with the id name. In case this preset
   already exists, the old one will only be overwritten if force is
   set to t. This function normally doesn't need to be called
   explicitely. The preferred mechanism to deal with sfz presets is by
   using a combination of [[add-sfz-preset][add-sfz-preset]] and [[ensure-sfz-preset][ensure-sfz-preset]].

*** Arguments
    =file= Path or filename of the sfz file to load

    =name= symbol to identify the preset (preferably a keyword, but any
    symbol works)

    =:force= Force loading of the preset even if it already exists.

    =:play-fn= The play-fn to use when playing a sound. Possible choices
    are

      - [[play-sfz-loop][#'play-sfz-loop]]

        If loop points are set, play the loop in case the duration
        exceeds (- loop-end start). If no loop points are set, loop
        the whole sample.

      - [[play-sfz-one-shot][#'play-sfz-one-shot]]

        Just play sample once even if duration exceeds sample length.
*** Example
   #+BEGIN_SRC lisp
     (load-sfz-preset "~/quicklisp/local-projects/clamps/packages/cl-sfz/snd/sfz/Flute-nv/000_Flute-nv.sfz" :flute-nv)
   #+END_SRC
*** See also
    - [[add-sfz-preset][add-sfz-preset]]

    - [[ensure-sfz-preset][ensure-sfz-preset]]

    - [[remove-sfz-preset][remove-sfz-preset]]
** logger-level
   Function
   #+BEGIN_SRC lisp
     (logger-level)
   #+END_SRC
   Return or set the current logger level.  The logger level
   can be one of:

   =:error=

   =:warn=

   =:info=

   =:debug=

   For a description and examples, see [[overview:Debugging Tools][Debugging Tools]].
*** See also
    - [[msg][msg]]
** lsample
   Struct
*** Slots:
*** See also
    - [[sfz][sfz]]
* M
** m-exp
   Function
   #+BEGIN_SRC lisp
     (m-exp x min max)
   #+END_SRC
   Return the exponential interpolation for a MIDI value in the range
   /[min..max]/ as a float value. The min and max values have to be
   positive.
*** Arguments
    =x= An input value in the range /[0..127]/ to be interpolated.
    
    =min= The output value for /x = 0/.

    =max= The output value for /x = 127/.
*** Examples
    #+BEGIN_SRC lisp
      (m-exp 0 1 100) ; => 1.0 (100.0%)

      (m-exp 64 1 100) ; => 10.18296

      (m-exp 127 1 100) ; => 100.0
    #+END_SRC
*** See also
    - [[exp-n][exp-n]]

    - [[lin-n][lin-n]]

    - [[m-lin][m-lin]]
    
    - [[n-exp][n-exp]]

    - [[n-exp-dev][n-exp-dev]]

    - [[n-lin][n-lin]]

    - [[n-lin-dev][n-lin-dev]]
** m-lin
   Function
   #+BEGIN_SRC lisp
     (m-lin x min max)
   #+END_SRC
   Return the linear interpolation for a MIDI value in the range
   /[min..max]/ as a float value.
*** Arguments
    =x= An input value in the range /[0..127]/ to be interpolated.
    
    =min= The output value for /x = 0/.

    =max= The output value for /x = 127/.
*** Examples
    #+BEGIN_SRC lisp
      (m-lin 0 10 20) ; => 10.0

      (m-lin 64 10 20) ; => 15.039371

      (m-lin 127 10 20)  ; => 20.0
    #+END_SRC
*** See also
    - [[exp-n][exp-n]]

    - [[lin-n][lin-n]]

    - [[m-exp][m-exp]]
    
    - [[n-exp][n-exp]]

    - [[n-exp-dev][n-exp-dev]]

    - [[n-lin][n-lin]]

    - [[n-lin-dev][n-lin-dev]]
** make-computed
   Function
   #+BEGIN_SRC lisp
     (make-computed fn &optional (setter nil))
   #+END_SRC
   Return a [[ref-object][ref-object]] which recalculates and sets its value using
   /fn/ whenever a ref-object accessed with [[get-val][get-val]] in the body of
   /fn/ is changed.

   Refer to [[clamps:Defining relations][Defining relations]] in the Clamps documentation for
   examples.
