doc/clamps-dictionary.html
<div id="outline-container-org5f00253" class="outline-2">
<h2 id="org5f00253">L</h2>
<div class="outline-text-2" id="text-org5f00253">
</div>
<div id="outline-container-org5869d83" class="outline-3">
<h3 id="org5869d83">lin-n</h3>
<div class="outline-text-3" id="text-org5869d83">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>lin-n x min max<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the reverse linear interpolation for a value in the range
<i>[min..max]</i> as a normalized float value.
</p>
</div>
<div id="outline-container-org4e53f29" class="outline-4">
<h4 id="org4e53f29">Arguments</h4>
<div class="outline-text-4" id="text-org4e53f29">
<p>
<code>x</code> An input value in the range <i>[min..max]</i> to be interpolated.
</p>

<p>
<code>min</code> The minimum value.
</p>

<p>
<code>max</code> The maximum value.
</p>
</div>
</div>
<div id="outline-container-orgc0b3c0e" class="outline-4">
<h4 id="orgc0b3c0e">Examples</h4>
<div class="outline-text-4" id="text-orgc0b3c0e">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>lin-n 10 10 20<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 0.0</span>

<span style="color: #ffff00;">(</span>lin-n 15 10 20<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 0.5</span>

<span style="color: #ffff00;">(</span>lin-n 20 10 20<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 1.0</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4fbe632" class="outline-4">
<h4 id="org4fbe632">See also</h4>
<div class="outline-text-4" id="text-org4fbe632">
<ul class="org-ul">
<li><a href="#org3d573ca">exp-n</a></li>

<li><a href="#org37fe3ef">m-exp</a></li>

<li><a href="#org15d887c">m-lin</a></li>

<li><a href="#org2bffe24">n-exp</a></li>

<li><a href="#orgb710de9">n-exp-dev</a></li>

<li><a href="#org892548b">n-lin</a></li>

<li><a href="#orgee8763b">n-lin-dev</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4a3a1aa" class="outline-3">
<h3 id="org4a3a1aa">list-sfz-presets</h3>
<div class="outline-text-3" id="text-org4a3a1aa">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>list-sfz-presets <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>loaded nil<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return a sorted list of all sfz preset names.
</p>
</div>
<div id="outline-container-org881b01b" class="outline-4">
<h4 id="org881b01b">Arguments</h4>
<div class="outline-text-4" id="text-org881b01b">
<p>
<code>:loaded</code> Boolean to indicate whether only the preset names of
loaded presets should be returned. If <i>nil</i> all registered preset
names are returned.
</p>
</div>
</div>
</div>
<div id="outline-container-org9315be4" class="outline-3">
<h3 id="org9315be4">load-sfz-preset</h3>
<div class="outline-text-3" id="text-org9315be4">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>load-sfz-preset file name <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> force <span style="color: #a9a9a9;">(</span>play-fn #'play-sfz-loop<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>

<p>
Load a sfz file into a preset with the id name. In case this preset
already exists, the old one will only be overwritten if force is
set to t. This function normally doesn't need to be called
explicitely. The preferred mechanism to deal with sfz presets is by
using a combination of <a href="#org1ea3aae">add-sfz-preset</a> and <a href="#org24d51ec">ensure-sfz-preset</a>.
</p>
</div>
<div id="outline-container-org2b73b4e" class="outline-4">
<h4 id="org2b73b4e">Arguments</h4>
<div class="outline-text-4" id="text-org2b73b4e">
<p>
<code>file</code> Path or filename of the sfz file to load
</p>

<p>
<code>name</code> symbol to identify the preset (preferably a keyword, but any
symbol works)
</p>

<p>
<code>:force</code> Force loading of the preset even if it already exists.
</p>

<p>
<code>:play-fn</code> The play-fn to use when playing a sound. Possible choices
are
</p>

<ul class="org-ul">
<li><p>
<a href="#orgd08b988">#'play-sfz-loop</a>
</p>

<p>
If loop points are set, play the loop in case the duration
exceeds (- loop-end start). If no loop points are set, loop
the whole sample.
</p></li>

<li><p>
<a href="#org868f855">#'play-sfz-one-shot</a>
</p>

<p>
Just play sample once even if duration exceeds sample length.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org08cd582" class="outline-4">
<h4 id="org08cd582">Example</h4>
<div class="outline-text-4" id="text-org08cd582">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>load-sfz-preset <span style="color: #87cefa;">"~/quicklisp/local-projects/clamps/packages/cl-sfz/snd/sfz/Flute-nv/000_Flute-nv.sfz"</span> <span style="color: #7fffd4;">:flute-nv</span><span style="color: #ffff00;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org21a941d" class="outline-4">
<h4 id="org21a941d">See also</h4>
<div class="outline-text-4" id="text-org21a941d">
<ul class="org-ul">
<li><a href="#org1ea3aae">add-sfz-preset</a></li>

<li><a href="#org24d51ec">ensure-sfz-preset</a></li>

<li><a href="#org951c3ba">remove-sfz-preset</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org789f687" class="outline-3">
<h3 id="org789f687">logger-level</h3>
<div class="outline-text-3" id="text-org789f687">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>logger-level<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return or set the current logger level.  The logger level
can be one of:
</p>

<p>
<code>:error</code>
</p>

<p>
<code>:warn</code>
</p>

<p>
<code>:info</code>
</p>

<p>
<code>:debug</code>
</p>

<p>
For a description and examples, see <a href="../clamps/04_04_debugging-tools.html">Debugging Tools</a>.
</p>
</div>
<div id="outline-container-org594822e" class="outline-4">
<h4 id="org594822e">See also</h4>
<div class="outline-text-4" id="text-org594822e">
<ul class="org-ul">
<li><a href="#orgc14b873">msg</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc3ef1fd" class="outline-3">
<h3 id="orgc3ef1fd">lsample</h3>
<div class="outline-text-3" id="text-orgc3ef1fd">
<p>
Struct
</p>
</div>
<div id="outline-container-orgbb35850" class="outline-4">
<h4 id="orgbb35850">Slots:</h4>
</div>
<div id="outline-container-org1c10967" class="outline-4">
<h4 id="org1c10967">See also</h4>
<div class="outline-text-4" id="text-org1c10967">
<ul class="org-ul">
<li><a href="#orgf99d308">sfz</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orge3b7866" class="outline-2">
<h2 id="orge3b7866">M</h2>
<div class="outline-text-2" id="text-orge3b7866">
</div>
<div id="outline-container-org37fe3ef" class="outline-3">
<h3 id="org37fe3ef">m-exp</h3>
<div class="outline-text-3" id="text-org37fe3ef">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>m-exp x min max<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the exponential interpolation for a MIDI value in the range
<i>[min..max]</i> as a float value. The min and max values have to be
positive.
</p>
</div>
<div id="outline-container-org80c5af8" class="outline-4">
<h4 id="org80c5af8">Arguments</h4>
<div class="outline-text-4" id="text-org80c5af8">
<p>
<code>x</code> An input value in the range <i>[0..127]</i> to be interpolated.
</p>

<p>
<code>min</code> The output value for <i>x = 0</i>.
</p>

<p>
<code>max</code> The output value for <i>x = 127</i>.
</p>
</div>
</div>
<div id="outline-container-org5617894" class="outline-4">
<h4 id="org5617894">Examples</h4>
<div class="outline-text-4" id="text-org5617894">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>m-exp 0 1 100<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 1.0 (100.0%)</span>

<span style="color: #ffff00;">(</span>m-exp 64 1 100<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 10.18296</span>

<span style="color: #ffff00;">(</span>m-exp 127 1 100<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 100.0</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c4de77" class="outline-4">
<h4 id="org4c4de77">See also</h4>
<div class="outline-text-4" id="text-org4c4de77">
<ul class="org-ul">
<li><a href="#org3d573ca">exp-n</a></li>

<li><a href="#org5869d83">lin-n</a></li>

<li><a href="#org15d887c">m-lin</a></li>

<li><a href="#org2bffe24">n-exp</a></li>

<li><a href="#orgb710de9">n-exp-dev</a></li>

<li><a href="#org892548b">n-lin</a></li>

<li><a href="#orgee8763b">n-lin-dev</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org15d887c" class="outline-3">
<h3 id="org15d887c">m-lin</h3>
<div class="outline-text-3" id="text-org15d887c">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>m-lin x min max<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the linear interpolation for a MIDI value in the range
<i>[min..max]</i> as a float value.
</p>
</div>
<div id="outline-container-orge77b91f" class="outline-4">
<h4 id="orge77b91f">Arguments</h4>
<div class="outline-text-4" id="text-orge77b91f">
<p>
<code>x</code> An input value in the range <i>[0..127]</i> to be interpolated.
</p>

<p>
<code>min</code> The output value for <i>x = 0</i>.
</p>

<p>
<code>max</code> The output value for <i>x = 127</i>.
</p>
</div>
</div>
<div id="outline-container-org3662e6c" class="outline-4">
<h4 id="org3662e6c">Examples</h4>
<div class="outline-text-4" id="text-org3662e6c">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>m-lin 0 10 20<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 10.0</span>

<span style="color: #ffff00;">(</span>m-lin 64 10 20<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 15.039371</span>

<span style="color: #ffff00;">(</span>m-lin 127 10 20<span style="color: #ffff00;">)</span>  <span style="color: #add8e6;">; =&gt; 20.0</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge4b3595" class="outline-4">
<h4 id="orge4b3595">See also</h4>
<div class="outline-text-4" id="text-orge4b3595">
<ul class="org-ul">
<li><a href="#org3d573ca">exp-n</a></li>

<li><a href="#org5869d83">lin-n</a></li>

<li><a href="#org37fe3ef">m-exp</a></li>

<li><a href="#org2bffe24">n-exp</a></li>

<li><a href="#orgb710de9">n-exp-dev</a></li>

<li><a href="#org892548b">n-lin</a></li>

<li><a href="#orgee8763b">n-lin-dev</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd23f998" class="outline-3">
<h3 id="orgd23f998">make-computed</h3>
<div class="outline-text-3" id="text-orgd23f998">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>make-computed fn <span style="color: #87ceeb; font-weight: bold;">&amp;optional</span> <span style="color: #a9a9a9;">(</span>setter nil<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return a <a href="#orgd22c573">ref-object</a> which recalculates and sets its value using
<i>fn</i> whenever a ref-object accessed with <a href="#org30f229f">get-val</a> in the body of
<i>fn</i> is changed.
</p>

<p>
Refer to <a href="../nil">Defining relations</a> in the Clamps documentation for
examples.
</p>
</div>
