doc/clamps-dictionary.org
*** Arguments
    =fn= Function of no arguments to call whenever a value accessed
    using [[get-val][get-val]] in the body of the function is changed.

    =setter= Function of one argument called with the value of the
    ref-object returned by /make-computed/ whenever it changes.
*** See also
    - [[get-val][get-val]]

    - [[make-ref][make-ref]]

    - [[set-val][set-val]]

    - [[watch][watch]]
** make-ref
   Function
   #+BEGIN_SRC lisp
     (make-ref val &rest args)
   #+END_SRC
   Return an instance of [[ref-object][ref-object]] with initial value /val/.
*** Arguments
    =val= Initial value of the created instance. It can be of any
    type.

    =args= Optional args supplied to make-instance. They are used
    internally and are not intended to be used directly when working
    with /cl-refs/.
*** See also
    - [[get-val][get-val]]

    - [[make-computed][make-computed]]

    - [[set-val][set-val]]

    - [[watch][watch]]
** meters
   Function
   #+BEGIN_SRC lisp
     (meters)
   #+END_SRC
   Open the levelmeter page at /<clamps-base-url>/meters/ in a
   Browser.
*** See also
    - [[clamps-base-url][clamps-base-url]]
    - [[gui][gui]]
** mtof
   Function
   #+BEGIN_SRC lisp
     (mtof midi-value &key (tuning-base *standard-pitch*))
   #+END_SRC
   Convert pitch in Midicts to frequency in Hz.
*** Arguments
    =midi-value= Pitch in Midicents.

    =:tuning-base= Frequency of A4 in Hz.
*** Examples
    #+BEGIN_SRC lisp
      (mtof 69) ; => 440

      (mtof 60.5) ; => 269.29178

      (mtof 69 :tuning-base 415) ; => 415
    #+END_SRC
*** See also
    - [[ftom][ftom]]
** msg
   Macro
   #+BEGIN_SRC lisp
     (msg type format-control &rest format-arguments)
   #+END_SRC
   Print a message to /*logger-stream*/ when the current logger-level
   is >= /type/.

   For a description and examples, see [[overview:Debugging Tools][Debugging Tools]].
*** Arguments
    =type= The logger level, one of /:error/, /:warn/, /:info/ or /:debug/.

    =format-control= A control string with the same syntax as Common
    Lisps /format/ macro.

    =format-arguments= Arguments to the control string with the same
    behaviour as in Common Lisps /format/ macro.
*** See also
    - [[logger-level][logger-level]]
* N - O
** n-exp
   Function
   #+BEGIN_SRC lisp
     (n-exp x min max)
   #+END_SRC
   Return the exponential interpolation for a normalized value in the
   range /[min..max]/ as a float value.
*** Arguments
    =x= An input value in the range /[0..1]/ to be interpolated.
    
    =min= The output value for /x = 0/.

    =max= The output value for /x = 1/.
*** Examples
    #+BEGIN_SRC lisp
      (n-exp 0 1 100) ; => 1.0

      (n-exp 0.5 1 100) ; => 10.0

      (n-exp 1 1 100) ; => 100.0
    #+END_SRC
*** See also
    - [[exp-n][exp-n]]

    - [[lin-n][lin-n]]

    - [[m-exp][m-exp]]

    - [[m-lin][m-lin]]
    
    - [[n-exp-dev][n-exp-dev]]

    - [[n-lin][n-lin]]

    - [[n-lin-dev][n-lin-dev]]
** n-exp-dev
   Function
   #+BEGIN_SRC lisp
     (n-exp-dev x max)
   #+END_SRC
   Return a random deviation factor, the deviation being exponentially
   interpolated between /1/ for /x = 0/ and /[1/max..max]/ for /x = 1/.
*** Arguments
    =x= An input value in the range /[0..1]/ to be interpolated.

    =max= The maximum deviation factor for /x = 1/;
*** Examples
    #+BEGIN_SRC lisp
      (n-exp-dev 0 4) ; => 1.0

      (n-exp-dev 0.5 4) ; a random value exponentially distributed in the range [0.5..2.0]

      (n-exp-dev 1 4) ; a random value exponentially distributed in the range [0.25..4.0]
    #+END_SRC
*** See also
    - [[exp-n][exp-n]]

    - [[lin-n][lin-n]]

    - [[m-exp][m-exp]]

    - [[m-lin][m-lin]]

    - [[n-exp][n-exp]]

    - [[n-lin][n-lin]]

    - [[n-lin-dev][n-lin-dev]]
** n-lin
   Function
   #+BEGIN_SRC lisp
     (n-lin x min max)
   #+END_SRC
   Return the linear interpolation for a normalized value in the range
   /[min..max]/ as a float value.
*** Arguments
    =x= An input value in the range /[0..1]/ to be interpolated.
    
    =min= The output value for /x = 0/.

    =max= The output value for /x = 1/.
*** Examples
    #+BEGIN_SRC lisp
      (n-lin 0 10 20) ; => 10.0

      (n-lin 0.5 10 20) ; => 15.0

      (n-lin 1 10 20)  ; => 20.0
    #+END_SRC
*** See also
    - [[exp-n][exp-n]]

    - [[lin-n][lin-n]]

    - [[m-exp][m-exp]]

    - [[m-lin][m-lin]]
    
    - [[n-exp][n-exp]]

    - [[n-exp-dev][n-exp-dev]]

    - [[n-lin-dev][n-lin-dev]]
