doc/clamps-dictionary.html
<div id="outline-container-org77249a2" class="outline-4">
<h4 id="org77249a2">Arguments</h4>
<div class="outline-text-4" id="text-org77249a2">
<p>
<code>fn</code> Function of no arguments to call whenever a value accessed
using <a href="#org30f229f">get-val</a> in the body of the function is changed.
</p>

<p>
<code>setter</code> Function of one argument called with the value of the
ref-object returned by <i>make-computed</i> whenever it changes.
</p>
</div>
</div>
<div id="outline-container-org1e0c180" class="outline-4">
<h4 id="org1e0c180">See also</h4>
<div class="outline-text-4" id="text-org1e0c180">
<ul class="org-ul">
<li><a href="#org30f229f">get-val</a></li>

<li><a href="#orgf28e231">make-ref</a></li>

<li><a href="#org4b2eaca">set-val</a></li>

<li><a href="#org1d9cbb3">watch</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf28e231" class="outline-3">
<h3 id="orgf28e231">make-ref</h3>
<div class="outline-text-3" id="text-orgf28e231">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>make-ref val <span style="color: #87ceeb; font-weight: bold;">&amp;rest</span> args<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return an instance of <a href="#orgd22c573">ref-object</a> with initial value <i>val</i>.
</p>
</div>
<div id="outline-container-org9e2b730" class="outline-4">
<h4 id="org9e2b730">Arguments</h4>
<div class="outline-text-4" id="text-org9e2b730">
<p>
<code>val</code> Initial value of the created instance. It can be of any
type.
</p>

<p>
<code>args</code> Optional args supplied to make-instance. They are used
internally and are not intended to be used directly when working
with <i>cl-refs</i>.
</p>
</div>
</div>
<div id="outline-container-org75c2b4a" class="outline-4">
<h4 id="org75c2b4a">See also</h4>
<div class="outline-text-4" id="text-org75c2b4a">
<ul class="org-ul">
<li><a href="#org30f229f">get-val</a></li>

<li><a href="#orgd23f998">make-computed</a></li>

<li><a href="#org4b2eaca">set-val</a></li>

<li><a href="#org1d9cbb3">watch</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf2bdcc6" class="outline-3">
<h3 id="orgf2bdcc6">meters</h3>
<div class="outline-text-3" id="text-orgf2bdcc6">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>meters<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Open the levelmeter page at <i>&lt;clamps-base-url&gt;/meters</i> in a
Browser.
</p>
</div>
<div id="outline-container-org937983b" class="outline-4">
<h4 id="org937983b">See also</h4>
<div class="outline-text-4" id="text-org937983b">
<ul class="org-ul">
<li><a href="#orgacaa029">clamps-base-url</a></li>
<li><a href="#org08c56ec">gui</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org41aca11" class="outline-3">
<h3 id="org41aca11">mtof</h3>
<div class="outline-text-3" id="text-org41aca11">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>mtof midi-value <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>tuning-base *standard-pitch*<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Convert pitch in Midicts to frequency in Hz.
</p>
</div>
<div id="outline-container-org06f1ae4" class="outline-4">
<h4 id="org06f1ae4">Arguments</h4>
<div class="outline-text-4" id="text-org06f1ae4">
<p>
<code>midi-value</code> Pitch in Midicents.
</p>

<p>
<code>:tuning-base</code> Frequency of A4 in Hz.
</p>
</div>
</div>
<div id="outline-container-orgf5f25f4" class="outline-4">
<h4 id="orgf5f25f4">Examples</h4>
<div class="outline-text-4" id="text-orgf5f25f4">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>mtof 69<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 440</span>

<span style="color: #ffff00;">(</span>mtof 60.5<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 269.29178</span>

<span style="color: #ffff00;">(</span>mtof 69 <span style="color: #7fffd4;">:tuning-base</span> 415<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 415</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org87b6853" class="outline-4">
<h4 id="org87b6853">See also</h4>
<div class="outline-text-4" id="text-org87b6853">
<ul class="org-ul">
<li><a href="#org3ecc4e8">ftom</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc14b873" class="outline-3">
<h3 id="orgc14b873">msg</h3>
<div class="outline-text-3" id="text-orgc14b873">
<p>
Macro
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>msg type format-control <span style="color: #87ceeb; font-weight: bold;">&amp;rest</span> format-arguments<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Print a message to <i><b>logger-stream</b></i> when the current logger-level
is &gt;= <i>type</i>.
</p>

<p>
For a description and examples, see <a href="../clamps/04_04_debugging-tools.html">Debugging Tools</a>.
</p>
</div>
<div id="outline-container-orgb541db9" class="outline-4">
<h4 id="orgb541db9">Arguments</h4>
<div class="outline-text-4" id="text-orgb541db9">
<p>
<code>type</code> The logger level, one of <i>:error</i>, <i>:warn</i>, <i>:info</i> or <i>:debug</i>.
</p>

<p>
<code>format-control</code> A control string with the same syntax as Common
Lisps <i>format</i> macro.
</p>

<p>
<code>format-arguments</code> Arguments to the control string with the same
behaviour as in Common Lisps <i>format</i> macro.
</p>
</div>
</div>
<div id="outline-container-org90d8c93" class="outline-4">
<h4 id="org90d8c93">See also</h4>
<div class="outline-text-4" id="text-org90d8c93">
<ul class="org-ul">
<li><a href="#org789f687">logger-level</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfed93f9" class="outline-2">
<h2 id="orgfed93f9">N - O</h2>
<div class="outline-text-2" id="text-orgfed93f9">
</div>
<div id="outline-container-org2bffe24" class="outline-3">
<h3 id="org2bffe24">n-exp</h3>
<div class="outline-text-3" id="text-org2bffe24">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>n-exp x min max<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the exponential interpolation for a normalized value in the
range <i>[min..max]</i> as a float value.
</p>
</div>
<div id="outline-container-org3ddd3e1" class="outline-4">
<h4 id="org3ddd3e1">Arguments</h4>
<div class="outline-text-4" id="text-org3ddd3e1">
<p>
<code>x</code> An input value in the range <i>[0..1]</i> to be interpolated.
</p>

<p>
<code>min</code> The output value for <i>x = 0</i>.
</p>

<p>
<code>max</code> The output value for <i>x = 1</i>.
</p>
</div>
</div>
<div id="outline-container-orga0d2561" class="outline-4">
<h4 id="orga0d2561">Examples</h4>
<div class="outline-text-4" id="text-orga0d2561">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>n-exp 0 1 100<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 1.0</span>

<span style="color: #ffff00;">(</span>n-exp 0.5 1 100<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 10.0</span>

<span style="color: #ffff00;">(</span>n-exp 1 1 100<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 100.0</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd78c39" class="outline-4">
<h4 id="orgdd78c39">See also</h4>
<div class="outline-text-4" id="text-orgdd78c39">
<ul class="org-ul">
<li><a href="#org3d573ca">exp-n</a></li>

<li><a href="#org5869d83">lin-n</a></li>

<li><a href="#org37fe3ef">m-exp</a></li>

<li><a href="#org15d887c">m-lin</a></li>

<li><a href="#orgb710de9">n-exp-dev</a></li>

<li><a href="#org892548b">n-lin</a></li>

<li><a href="#orgee8763b">n-lin-dev</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb710de9" class="outline-3">
<h3 id="orgb710de9">n-exp-dev</h3>
<div class="outline-text-3" id="text-orgb710de9">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>n-exp-dev x max<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return a random deviation factor, the deviation being exponentially
interpolated between <i>1</i> for <i>x = 0</i> and <i>[1/max..max]</i> for <i>x = 1</i>.
</p>
</div>
<div id="outline-container-org472816e" class="outline-4">
<h4 id="org472816e">Arguments</h4>
<div class="outline-text-4" id="text-org472816e">
<p>
<code>x</code> An input value in the range <i>[0..1]</i> to be interpolated.
</p>

<p>
<code>max</code> The maximum deviation factor for <i>x = 1</i>;
</p>
</div>
</div>
<div id="outline-container-orgcc6ad24" class="outline-4">
<h4 id="orgcc6ad24">Examples</h4>
<div class="outline-text-4" id="text-orgcc6ad24">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>n-exp-dev 0 4<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 1.0</span>

<span style="color: #ffff00;">(</span>n-exp-dev 0.5 4<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; a random value exponentially distributed in the range [0.5..2.0]</span>

<span style="color: #ffff00;">(</span>n-exp-dev 1 4<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; a random value exponentially distributed in the range [0.25..4.0]</span>
</pre>
</div>
</div>
</div>
