doc/clamps-dictionary.org
** n-lin-dev
   Function
   #+BEGIN_SRC lisp
     (n-lin-dev x max)
   #+END_SRC
   Return a random deviation value, the deviation being linearly
   interpolated between /0/ for /x = 0/ and /[-max..max]/ for /x = 1/.
*** Arguments
    =x= An input value in the range /[0..1]/ to be interpolated.

    =max= The maximum deviation value for /x = 1/;
*** Examples
    #+BEGIN_SRC lisp
      (n-lin-dev 0 4) ; => 0

      (n-lin-dev 0.5 4) ; a random value linearly distributed in the range [-2.0..2.0]

      (n-lin-dev 1 4) ; a random value linearly distributed in the range [-4.0..4.0]
    #+END_SRC
*** See also
    - [[exp-n][exp-n]]

    - [[lin-n][lin-n]]

    - [[m-exp][m-exp]]

    - [[m-lin][m-lin]]
    
    - [[n-exp][n-exp]]

    - [[n-exp-dev][n-exp-dev]]

    - [[n-lin][n-lin]]
** node-free-unprotected
   Function
   #+BEGIN_SRC lisp
     (node-free-unprotected)
   #+END_SRC
   Free all Incudine nodes of /group 200/.
*** See also
    - [[rts-hush][rts-hush]]
* P - Q
** play-sfz
   Function
   #+BEGIN_SRC lisp
     (play-sfz pitch db dur &key (pan 0.5) (preset :flute-nv) (startpos 0) (out1 0) out2)
   #+END_SRC

   Play a sfz preset with stereo panning to incudine's audio outputs
   or a bus using the /play-fn/ of the sample to be played.
*** Arguments
    =pitch= Pitch in Midicent.
 
    =db= Amplitude in dB. /0/ corresponds to a
    scaling factor of /1/, /-100/ to a scaling factor of /0/.
 
    =dur= Duration in seconds.
 
    =:pan= Number in the range /[0..1]/ defining equal power panning
    between /out0/ and /out1/.
 
    =:preset= The name of a registered preset. If the preset hasn't been
    loaded it will get loaded before playback starts.
 
    =:startpos= The startposition in the sample in seconds.
 
    =:out1= Zero based index of the first outlet.
 
    =:out2= Zero based index of the second outlet. If not specified, /(mod (1+ out1) 8)/ will be used.
*** See also
    - [[play-sfz-loop][play-sfz-loop]]

    - [[play-sfz-one-shot][play-sfz-one-shot]]
** play-sfz-loop
   Function
   #+BEGIN_SRC lisp
     (play-sfz pitch db dur &key (pan 0.5) (preset :flute-nv) (startpos 0) (out1 0) out2)
   #+END_SRC

   Play a sfz preset with stereo panning to incudine's audio outputs
   or a bus. Loop the sound according to the loop settings of the
   sample in the sfz file or loop the whole sound if not present. This
   function always uses loop playback regardless of the setting of
   /play-fn/ in the sample to be played.
   
*** Arguments
    =pitch= Pitch in Midicent.
 
    =db= Amplitude in dB. /0/ corresponds to a scaling factor of /1/,
    /-100/ to a scaling factor of /0/.
 
    =dur= Duration in seconds.
 
    =:pan= Number in the range /[0..1]/ defining equal power panning
    between /out0/ and /out1/.
 
    =:preset= The name of a registered preset. If the preset hasn't been
    loaded it will get loaded before playback starts.
 
    =:startpos= The startposition in the sample in seconds.
 
    =:out1= Zero based index of the first outlet.
 
    =:out2= Zero based index of the second outlet. If not specified, /(mod (1+ out1) 8)/ will be used.
 
*** See also
    - [[play-sfz][play-sfz]]

    - [[play-sfz-one-shot][play-sfz-one-shot]]
** play-sfz-one-shot
   Function
   #+BEGIN_SRC lisp
     (play-sfz-one-shot pitch db dur &key (pan 0.5) (preset :flute-nv) (startpos 0) (out1 0) out2)
   #+END_SRC

   Play a sfz preset with stereo panning to incudine's audio outputs
   or a bus once (regardless of the setting of /play-fn/ in the sample
   to be played).
*** Arguments
    =pitch= Pitch in Midicent.
 
    =db= Amplitude in dB. /0/ corresponds to a
    scaling factor of /1/, /-100/ to a scaling factor of /0/.
 
    =dur= Duration in seconds.
 
    =:pan= Number in the range /[0..1]/ defining equal power panning
    between /out0/ and /out1/.
    
    =:preset= The name of a registered preset. If the preset hasn't been
    loaded it will get loaded before playback starts.
 
    =:startpos= The startposition in the sample in seconds.
 
    =:out1= Zero based index of the first outlet.
 
    =:out2= Zero based index of the second outlet. If not specified, /(mod (1+ out1) 8)/ will be used.
 
*** See also
    - [[play-sfz][play-sfz]]

    - [[play-sfz-loop][play-sfz-loop]]
