doc/clamps-dictionary.html
<div id="outline-container-org0a7ac0b" class="outline-4">
<h4 id="org0a7ac0b">See also</h4>
<div class="outline-text-4" id="text-org0a7ac0b">
<ul class="org-ul">
<li><a href="#org3d573ca">exp-n</a></li>

<li><a href="#org5869d83">lin-n</a></li>

<li><a href="#org37fe3ef">m-exp</a></li>

<li><a href="#org15d887c">m-lin</a></li>

<li><a href="#org2bffe24">n-exp</a></li>

<li><a href="#org892548b">n-lin</a></li>

<li><a href="#orgee8763b">n-lin-dev</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org892548b" class="outline-3">
<h3 id="org892548b">n-lin</h3>
<div class="outline-text-3" id="text-org892548b">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>n-lin x min max<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the linear interpolation for a normalized value in the range
<i>[min..max]</i> as a float value.
</p>
</div>
<div id="outline-container-orga978617" class="outline-4">
<h4 id="orga978617">Arguments</h4>
<div class="outline-text-4" id="text-orga978617">
<p>
<code>x</code> An input value in the range <i>[0..1]</i> to be interpolated.
</p>

<p>
<code>min</code> The output value for <i>x = 0</i>.
</p>

<p>
<code>max</code> The output value for <i>x = 1</i>.
</p>
</div>
</div>
<div id="outline-container-orgb2adcee" class="outline-4">
<h4 id="orgb2adcee">Examples</h4>
<div class="outline-text-4" id="text-orgb2adcee">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>n-lin 0 10 20<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 10.0</span>

<span style="color: #ffff00;">(</span>n-lin 0.5 10 20<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 15.0</span>

<span style="color: #ffff00;">(</span>n-lin 1 10 20<span style="color: #ffff00;">)</span>  <span style="color: #add8e6;">; =&gt; 20.0</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9efbe83" class="outline-4">
<h4 id="org9efbe83">See also</h4>
<div class="outline-text-4" id="text-org9efbe83">
<ul class="org-ul">
<li><a href="#org3d573ca">exp-n</a></li>

<li><a href="#org5869d83">lin-n</a></li>

<li><a href="#org37fe3ef">m-exp</a></li>

<li><a href="#org15d887c">m-lin</a></li>

<li><a href="#org2bffe24">n-exp</a></li>

<li><a href="#orgb710de9">n-exp-dev</a></li>

<li><a href="#orgee8763b">n-lin-dev</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgee8763b" class="outline-3">
<h3 id="orgee8763b">n-lin-dev</h3>
<div class="outline-text-3" id="text-orgee8763b">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>n-lin-dev x max<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return a random deviation value, the deviation being linearly
interpolated between <i>0</i> for <i>x = 0</i> and <i>[-max..max]</i> for <i>x = 1</i>.
</p>
</div>
<div id="outline-container-orgd94da79" class="outline-4">
<h4 id="orgd94da79">Arguments</h4>
<div class="outline-text-4" id="text-orgd94da79">
<p>
<code>x</code> An input value in the range <i>[0..1]</i> to be interpolated.
</p>

<p>
<code>max</code> The maximum deviation value for <i>x = 1</i>;
</p>
</div>
</div>
<div id="outline-container-org88d32fe" class="outline-4">
<h4 id="org88d32fe">Examples</h4>
<div class="outline-text-4" id="text-org88d32fe">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>n-lin-dev 0 4<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; 0</span>

<span style="color: #ffff00;">(</span>n-lin-dev 0.5 4<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; a random value linearly distributed in the range [-2.0..2.0]</span>

<span style="color: #ffff00;">(</span>n-lin-dev 1 4<span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; a random value linearly distributed in the range [-4.0..4.0]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org83c63d1" class="outline-4">
<h4 id="org83c63d1">See also</h4>
<div class="outline-text-4" id="text-org83c63d1">
<ul class="org-ul">
<li><a href="#org3d573ca">exp-n</a></li>

<li><a href="#org5869d83">lin-n</a></li>

<li><a href="#org37fe3ef">m-exp</a></li>

<li><a href="#org15d887c">m-lin</a></li>

<li><a href="#org2bffe24">n-exp</a></li>

<li><a href="#orgb710de9">n-exp-dev</a></li>

<li><a href="#org892548b">n-lin</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc29b2b8" class="outline-3">
<h3 id="orgc29b2b8">node-free-unprotected</h3>
<div class="outline-text-3" id="text-orgc29b2b8">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>node-free-unprotected<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Free all Incudine nodes of <i>group 200</i>.
</p>
</div>
<div id="outline-container-org0e28885" class="outline-4">
<h4 id="org0e28885">See also</h4>
<div class="outline-text-4" id="text-org0e28885">
<ul class="org-ul">
<li><a href="#org6dbd3c6">rts-hush</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb04cc01" class="outline-2">
<h2 id="orgb04cc01">P - Q</h2>
<div class="outline-text-2" id="text-orgb04cc01">
</div>
<div id="outline-container-org62d2892" class="outline-3">
<h3 id="org62d2892">play-sfz</h3>
<div class="outline-text-3" id="text-org62d2892">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>play-sfz pitch db dur <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>pan 0.5<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>preset <span style="color: #7fffd4;">:flute-nv</span><span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>startpos 0<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>out1 0<span style="color: #a9a9a9;">)</span> out2<span style="color: #ffff00;">)</span>
</pre>
</div>

<p>
Play a sfz preset with stereo panning to incudine's audio outputs
or a bus using the <i>play-fn</i> of the sample to be played.
</p>
</div>
<div id="outline-container-org8f408e5" class="outline-4">
<h4 id="org8f408e5">Arguments</h4>
<div class="outline-text-4" id="text-org8f408e5">
<p>
<code>pitch</code> Pitch in Midicent.
</p>

<p>
<code>db</code> Amplitude in dB. <i>0</i> corresponds to a
scaling factor of <i>1</i>, <i>-100</i> to a scaling factor of <i>0</i>.
</p>

<p>
<code>dur</code> Duration in seconds.
</p>

<p>
<code>:pan</code> Number in the range <i>[0..1]</i> defining equal power panning
between <i>out0</i> and <i>out1</i>.
</p>

<p>
<code>:preset</code> The name of a registered preset. If the preset hasn't been
loaded it will get loaded before playback starts.
</p>

<p>
<code>:startpos</code> The startposition in the sample in seconds.
</p>

<p>
<code>:out1</code> Zero based index of the first outlet.
</p>

<p>
<code>:out2</code> Zero based index of the second outlet. If not specified, <i>(mod (1+ out1) 8)</i> will be used.
</p>
</div>
</div>
<div id="outline-container-orge7c9ebd" class="outline-4">
<h4 id="orge7c9ebd">See also</h4>
<div class="outline-text-4" id="text-orge7c9ebd">
<ul class="org-ul">
<li><a href="#orgd08b988">play-sfz-loop</a></li>

<li><a href="#org868f855">play-sfz-one-shot</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd08b988" class="outline-3">
<h3 id="orgd08b988">play-sfz-loop</h3>
<div class="outline-text-3" id="text-orgd08b988">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>play-sfz pitch db dur <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>pan 0.5<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>preset <span style="color: #7fffd4;">:flute-nv</span><span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>startpos 0<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>out1 0<span style="color: #a9a9a9;">)</span> out2<span style="color: #ffff00;">)</span>
</pre>
</div>

<p>
Play a sfz preset with stereo panning to incudine's audio outputs
or a bus. Loop the sound according to the loop settings of the
sample in the sfz file or loop the whole sound if not present. This
function always uses loop playback regardless of the setting of
<i>play-fn</i> in the sample to be played.
</p>
</div>
<div id="outline-container-orgaa85873" class="outline-4">
<h4 id="orgaa85873">Arguments</h4>
<div class="outline-text-4" id="text-orgaa85873">
<p>
<code>pitch</code> Pitch in Midicent.
</p>

<p>
<code>db</code> Amplitude in dB. <i>0</i> corresponds to a scaling factor of <i>1</i>,
<i>-100</i> to a scaling factor of <i>0</i>.
</p>

<p>
<code>dur</code> Duration in seconds.
</p>

<p>
<code>:pan</code> Number in the range <i>[0..1]</i> defining equal power panning
between <i>out0</i> and <i>out1</i>.
</p>

<p>
<code>:preset</code> The name of a registered preset. If the preset hasn't been
loaded it will get loaded before playback starts.
</p>

<p>
<code>:startpos</code> The startposition in the sample in seconds.
</p>

<p>
<code>:out1</code> Zero based index of the first outlet.
</p>

<p>
<code>:out2</code> Zero based index of the second outlet. If not specified, <i>(mod (1+ out1) 8)</i> will be used.
</p>
</div>
</div>
<div id="outline-container-org2d904a5" class="outline-4">
<h4 id="org2d904a5">See also</h4>
<div class="outline-text-4" id="text-org2d904a5">
<ul class="org-ul">
<li><a href="#org62d2892">play-sfz</a></li>

<li><a href="#org868f855">play-sfz-one-shot</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org868f855" class="outline-3">
<h3 id="org868f855">play-sfz-one-shot</h3>
<div class="outline-text-3" id="text-org868f855">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>play-sfz-one-shot pitch db dur <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>pan 0.5<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>preset <span style="color: #7fffd4;">:flute-nv</span><span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>startpos 0<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>out1 0<span style="color: #a9a9a9;">)</span> out2<span style="color: #ffff00;">)</span>
</pre>
</div>

<p>
Play a sfz preset with stereo panning to incudine's audio outputs
or a bus once (regardless of the setting of <i>play-fn</i> in the sample
to be played).
</p>
</div>
