doc/clamps-dictionary.org
*** Note:
    The soundfile buffers of the samples used in the sfz description
    and the association between the preset name and the sfz file are
    *not* removed! Only the association between the preset name, the
    keynums and the buffers are removed.
*** See also
    - [[load-sfz-preset][load-sfz-preset]]

    - [[get-sfz-preset][get-sfz-preset]]
** reset-logger-stream
   Function
   #+BEGIN_SRC lisp
     (reset-logger-stream)
   #+END_SRC
   Resets /incudine:*logger-stream*/ to /\ast{}error-output\ast{}/. Call this
   function, if calls to /incudine.util:msg/ don't produce any output
   in the REPL.

   This function needs to be called if /Clamps/ is started from a Lisp
   Image.
** rts?
   Function
   #+BEGIN_SRC lisp
     (rts?)
   #+END_SRC
   Checks if rts is started and running.
*** See also
    - [[rts][rts]]
** rts
   Function
   #+BEGIN_SRC lisp
     (rts &key (rt-wait 0))
   #+END_SRC
   Start the real-time system of Clamps. This functions sets the
   following special variables:

   =*midi-in1*= The default Midi Input

   =*midi-out1*= The default Midi Output

   =*rts-out*= The default output for realtime messages from
   Clamps/CM.

   It also starts the rt engine of incudine calling
   /incudine:rt-start/.
*** Arguments
    =rt-wait= Time in seconds to wait before starting.
*** Note:
    This command is an replacement of the /rts/ command of CM,
    described [[../cm-dict/index.html#rts-fn.html][here]], so none of the options mentioned there or the
    decription in [[../cm-dict/index.html#rts-topic.html][RTS]] apply to Clamps. Other related CM functions,
    like /rts-pause/, /rts-continue/ and /rts-stop/ also don't work in
    Clamps.
*** See also
    - [[rts?][rts?]]
** rts-hush
   Function
   #+BEGIN_SRC lisp
     (rts-hush)
   #+END_SRC
   Sends an all-notes-off message[fn:: See /ChannelModeMessages/ on [[https://midi.org/summary-of-midi-1-0-messages][this page]].] to all channels of /\ast{}​midi-out1\ast{}/ and
   calls [[node-free-unprotected][node-free-unprotected]].
*** Note:
    This command is bound to the Keyboard Sequence /<C-.>/ in emacs.
* S - V
** set-bpm
   Function
   #+BEGIN_SRC lisp
   (set-bpm bpm)
   #+END_SRC
   Synonym for [[set-tempo][set-tempo]]
** set-tempo
   Function
   #+BEGIN_SRC lisp
   (set-tempo bpm)
   #+END_SRC
   Set the tempo in beats per minute for both, CM and Incudine.
*** Arguments
    =bpm= Number of beats per minute.
*** See also
    - [[set-bpm][set-bpm]]
** set-standard-pitch
   Function
   #+BEGIN_SRC lisp
     (set-standard-pitch freq)
   #+END_SRC
   Set the /\ast{}standard-pitch\ast{}/ reference of /Clamps/ to /freq/ in Hz.
*** Arguments
    =freq= Frequency of A4 in Hz.
*** See also
    - [[\ast{}standard-pitch\ast{}][\ast{}standard-pitch\ast{}]]
** set-val
   Function
   #+BEGIN_SRC lisp
     (set-val ref value  &key (force nil))
   #+END_SRC
   Set the value of ref-object /ref/ to /value/ if different than
   previous value. If /force/ is non-nil, set in any case. Return
   value.
*** Arguments
    =ref= An instance of [[ref-object][ref-object]]

    =value= Any value of any type to be set.

    =force= A boolean indicating to set the value even if it is eql to
    the previous value of the ref-object.
*** See also
    - [[get-val][get-val]]

    - [[make-computed][make-computed]]

    - [[make-ref][make-ref]]

    - [[watch][watch]]
** sfz
   Class   
   #+BEGIN_SRC lisp
     (new sfz &key (keynum 60) (amplitude 0) (duration 1) (preset :flute-nv) (play-fn nil) (pan 0.5) (startpos 0) (chan 100))
   #+END_SRC
   Generates sfz Events.

   sfz accepts the following keywords:

   =:time= The output time in seconds, initially unbound.

   =:keynum= Keynum in Midicents

   =:amplitude= Amplitude in dB. /0/ corresponds to a scaling factor of /1/, /-100/ to a scaling factor of /0/.

   =:duration= Duration in seconds.

   =:preset= Keyword or symbol of a registered preset name.

   =:play-fn= The play function to be used for sample playback.

   =:pan= Number in the range /[0..1]/ defining equal power
   panning between the two outputs of the dsp on playback.

   =:startpos= The startposition in the sample in seconds.

   =:chan= The channel (layer) used in svg output.
   
   The sfz class defines or uses the following accessor functions:

   - [[../cm-dict/index.html#object-time-fn.html][object-time]]

   - [[sfz-keynum][sfz-keynum]]

   - [[sfz-amplitude][sfz-amplitude]]

   - [[sfz-duration][sfz-duration]]

   - [[sfz-preset][sfz-preset]]

   - [[sfz-play-fn][sfz-play-fn]]

   - [[sfz-pan][sfz-pan]]

   - [[sfz-startpos][sfz-startpos]]

   - [[sfz-chan][sfz-chan]]
