doc/clamps-dictionary.html
<div id="outline-container-org7745744" class="outline-4">
<h4 id="org7745744">Note:</h4>
<div class="outline-text-4" id="text-org7745744">
<p>
The soundfile buffers of the samples used in the sfz description
and the association between the preset name and the sfz file are
<b>not</b> removed! Only the association between the preset name, the
keynums and the buffers are removed.
</p>
</div>
</div>
<div id="outline-container-orgb867742" class="outline-4">
<h4 id="orgb867742">See also</h4>
<div class="outline-text-4" id="text-orgb867742">
<ul class="org-ul">
<li><a href="#org9315be4">load-sfz-preset</a></li>

<li><a href="#org86aa2cb">get-sfz-preset</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd8780c4" class="outline-3">
<h3 id="orgd8780c4">reset-logger-stream</h3>
<div class="outline-text-3" id="text-orgd8780c4">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>reset-logger-stream<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Resets <i>incudine:*logger-stream*</i> to <i>&lowast;error-output&lowast;</i>. Call this
function, if calls to <i>incudine.util:msg</i> don't produce any output
in the REPL.
</p>

<p>
This function needs to be called if <i>Clamps</i> is started from a Lisp
Image.
</p>
</div>
</div>
<div id="outline-container-org36e3b02" class="outline-3">
<h3 id="org36e3b02">rts?</h3>
<div class="outline-text-3" id="text-org36e3b02">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>rts?<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Checks if rts is started and running.
</p>
</div>
<div id="outline-container-org28e88dd" class="outline-4">
<h4 id="org28e88dd">See also</h4>
<div class="outline-text-4" id="text-org28e88dd">
<ul class="org-ul">
<li><a href="#org90dfe6a">rts</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org90dfe6a" class="outline-3">
<h3 id="org90dfe6a">rts</h3>
<div class="outline-text-3" id="text-org90dfe6a">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>rts <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>rt-wait 0<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Start the real-time system of Clamps. This functions sets the
following special variables:
</p>

<p>
<code>*midi-in1*</code> The default Midi Input
</p>

<p>
<code>*midi-out1*</code> The default Midi Output
</p>

<p>
<code>*rts-out*</code> The default output for realtime messages from
Clamps/CM.
</p>

<p>
It also starts the rt engine of incudine calling
<i>incudine:rt-start</i>.
</p>
</div>
<div id="outline-container-org0056f10" class="outline-4">
<h4 id="org0056f10">Arguments</h4>
<div class="outline-text-4" id="text-org0056f10">
<p>
<code>rt-wait</code> Time in seconds to wait before starting.
</p>
</div>
</div>
<div id="outline-container-org3171179" class="outline-4">
<h4 id="org3171179">Note:</h4>
<div class="outline-text-4" id="text-org3171179">
<p>
This command is an replacement of the <i>rts</i> command of CM,
described <a href="../cm-dict/index.html#rts-fn.html">here</a>, so none of the options mentioned there or the
decription in <a href="../cm-dict/index.html#rts-topic.html">RTS</a> apply to Clamps. Other related CM functions,
like <i>rts-pause</i>, <i>rts-continue</i> and <i>rts-stop</i> also don't work in
Clamps.
</p>
</div>
</div>
<div id="outline-container-org381a73e" class="outline-4">
<h4 id="org381a73e">See also</h4>
<div class="outline-text-4" id="text-org381a73e">
<ul class="org-ul">
<li><a href="#org36e3b02">rts?</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6dbd3c6" class="outline-3">
<h3 id="org6dbd3c6">rts-hush</h3>
<div class="outline-text-3" id="text-org6dbd3c6">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>rts-hush<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Sends an all-notes-off message<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> to all channels of <i>&lowast;midi-out1&lowast;</i> and
calls <a href="#orgc29b2b8">node-free-unprotected</a>.
</p>
</div>
<div id="outline-container-orga3cbd9e" class="outline-4">
<h4 id="orga3cbd9e">Note:</h4>
<div class="outline-text-4" id="text-orga3cbd9e">
<p>
This command is bound to the Keyboard Sequence <i>&lt;C-.&gt;</i> in emacs.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org55f4e87" class="outline-2">
<h2 id="org55f4e87">S - V</h2>
<div class="outline-text-2" id="text-org55f4e87">
</div>
<div id="outline-container-org1ac1072" class="outline-3">
<h3 id="org1ac1072">set-bpm</h3>
<div class="outline-text-3" id="text-org1ac1072">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>set-bpm bpm<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Synonym for <a href="#org2286128">set-tempo</a>
</p>
</div>
</div>
<div id="outline-container-org2286128" class="outline-3">
<h3 id="org2286128">set-tempo</h3>
<div class="outline-text-3" id="text-org2286128">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>set-tempo bpm<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Set the tempo in beats per minute for both, CM and Incudine.
</p>
</div>
<div id="outline-container-org61915b7" class="outline-4">
<h4 id="org61915b7">Arguments</h4>
<div class="outline-text-4" id="text-org61915b7">
<p>
<code>bpm</code> Number of beats per minute.
</p>
</div>
</div>
<div id="outline-container-orge24c16b" class="outline-4">
<h4 id="orge24c16b">See also</h4>
<div class="outline-text-4" id="text-orge24c16b">
<ul class="org-ul">
<li><a href="#org1ac1072">set-bpm</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbf5bd77" class="outline-3">
<h3 id="orgbf5bd77">set-standard-pitch</h3>
<div class="outline-text-3" id="text-orgbf5bd77">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>set-standard-pitch freq<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Set the <i>&lowast;standard-pitch&lowast;</i> reference of <i>Clamps</i> to <i>freq</i> in Hz.
</p>
</div>
<div id="outline-container-orgeeddcba" class="outline-4">
<h4 id="orgeeddcba">Arguments</h4>
<div class="outline-text-4" id="text-orgeeddcba">
<p>
<code>freq</code> Frequency of A4 in Hz.
</p>
</div>
</div>
<div id="outline-container-orgd79890d" class="outline-4">
<h4 id="orgd79890d">See also</h4>
<div class="outline-text-4" id="text-orgd79890d">
<ul class="org-ul">
<li><a href="#org4ee3faa">&lowast;standard-pitch&lowast;</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4b2eaca" class="outline-3">
<h3 id="org4b2eaca">set-val</h3>
<div class="outline-text-3" id="text-org4b2eaca">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>set-val ref value  <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>force nil<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Set the value of ref-object <i>ref</i> to <i>value</i> if different than
previous value. If <i>force</i> is non-nil, set in any case. Return
value.
</p>
</div>
<div id="outline-container-org10f408e" class="outline-4">
<h4 id="org10f408e">Arguments</h4>
<div class="outline-text-4" id="text-org10f408e">
<p>
<code>ref</code> An instance of <a href="#orgd22c573">ref-object</a>
</p>

<p>
<code>value</code> Any value of any type to be set.
</p>

<p>
<code>force</code> A boolean indicating to set the value even if it is eql to
the previous value of the ref-object.
</p>
</div>
</div>
<div id="outline-container-orgddcab65" class="outline-4">
<h4 id="orgddcab65">See also</h4>
<div class="outline-text-4" id="text-orgddcab65">
<ul class="org-ul">
<li><a href="#org30f229f">get-val</a></li>

<li><a href="#orgd23f998">make-computed</a></li>

<li><a href="#orgf28e231">make-ref</a></li>

<li><a href="#org1d9cbb3">watch</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf99d308" class="outline-3">
<h3 id="orgf99d308">sfz</h3>
<div class="outline-text-3" id="text-orgf99d308">
<p>
Class   
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>new sfz <span style="color: #87ceeb; font-weight: bold;">&amp;key</span> <span style="color: #a9a9a9;">(</span>keynum 60<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>amplitude 0<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>duration 1<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>preset <span style="color: #7fffd4;">:flute-nv</span><span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>play-fn nil<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>pan 0.5<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>startpos 0<span style="color: #a9a9a9;">)</span> <span style="color: #a9a9a9;">(</span>chan 100<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Generates sfz Events.
</p>

<p>
sfz accepts the following keywords:
</p>

<p>
<code>:time</code> The output time in seconds, initially unbound.
</p>

<p>
<code>:keynum</code> Keynum in Midicents
</p>

<p>
<code>:amplitude</code> Amplitude in dB. <i>0</i> corresponds to a scaling factor of <i>1</i>, <i>-100</i> to a scaling factor of <i>0</i>.
</p>

<p>
<code>:duration</code> Duration in seconds.
</p>

<p>
<code>:preset</code> Keyword or symbol of a registered preset name.
</p>

<p>
<code>:play-fn</code> The play function to be used for sample playback.
</p>

<p>
<code>:pan</code> Number in the range <i>[0..1]</i> defining equal power
panning between the two outputs of the dsp on playback.
</p>

<p>
<code>:startpos</code> The startposition in the sample in seconds.
</p>

<p>
<code>:chan</code> The channel (layer) used in svg output.
</p>

<p>
The sfz class defines or uses the following accessor functions:
</p>

<ul class="org-ul">
<li><a href="../cm-dict/index.html#object-time-fn.html">object-time</a></li>

<li><a href="#org6f2e6c0">sfz-keynum</a></li>

<li><a href="#orgbb9b648">sfz-amplitude</a></li>

<li><a href="#org0133edc">sfz-duration</a></li>

<li><a href="#org4973f5f">sfz-preset</a></li>

<li><a href="#org20ee4a6">sfz-play-fn</a></li>

<li><a href="#orgc0e83d7">sfz-pan</a></li>

<li><a href="#orgc115799">sfz-startpos</a></li>

<li><a href="#org5accb28">sfz-chan</a></li>
</ul>
</div>
