doc/clamps-dictionary.org
*** Examples:
#+BEGIN_SRC lisp
  (new sfz)
  ;; => #i(sfz keynum 60 amplitude 1 duration 1 preset :flute-nv
  ;;           play-fn nil pan 0.5 startpos 0 chan 100)

  ;; the following code should send 1 second of a flute middle C sound
  ;; to the first two oulets of incudine:

  (output (new sfz)) ; => ; No value

  ;; => loading :flute-nv from ~/quicklisp/local-projects/clamps/extra/snd/sfz/Flute-nv/000_Flute-nv.sfz
  ;; ; No values

  (loop
    for idx below 200
    for x = (/ idx 199)
    for time = 0 then (+ time (n-exp (interp x 0 0  0.3 1  1 0) 0.01 0.1))
    do (sprout
        (new sfz
          :time time
          :keynum (+ 65.5 (random (n-lin (interp x 0 0 1 1) 1 5)))
          :duration (+ 0.5 (random 2.0))
          :amplitude (n-lin (interp x 0 0 0.8 0 1 1) -12 -24))))

  ;; => nil
#+END_SRC
*** See also
    - [[add-sfz-preset][add-sfz-preset]]
      
    - [[lsample][lsample]]

    - [[play-sfz-loop][play-sfz-loop]]

    - [[play-sfz-one-shot][play-sfz-one-shot]]
** sfz-amplitude
   Function
   #+BEGIN_SRC lisp
     (sfz-amplitude sfz)
   #+END_SRC
   Amplitude of sfz instance in dB, setfable.
*** Arguments
    =sfz= Instance of class sfz.
*** See also
    - [[sfz][sfz]]
** sfz-chan
   Function
   #+BEGIN_SRC lisp
     (sfz-channel sfz)
   #+END_SRC
   Channel of sfz instance, setfable.
*** Arguments
    =sfz= Instance of class sfz.
*** See also
    - [[sfz][sfz]]
** sfz-duration
   Function
   #+BEGIN_SRC lisp
     (sfz-duration sfz)
   #+END_SRC
   Duration of sfz instance in seconds, setfable.
*** Arguments
    =sfz= Instance of class sfz.
*** See also
    - [[sfz][sfz]]
** sfz-get-range
   Function
   #+BEGIN_SRC lisp
     (sfz-get-range ref)
   #+END_SRC
   Return the keynum range of sfz denoted by /ref/.
*** Arguments
    =ref= Reference to the sfz. Can be the /keyword/ or /symbol/ of a
    registered sfz preset or a filename (pathname or string) of a sfz
    file. Relative filenames will be searched recursively in
    /\ast{}sfz-file-path\ast{}/.
*** See also
    - [[add-sfz-preset][add-sfz-preset]]
** sfz-keynum
   Function
   #+BEGIN_SRC lisp
     (sfz-keynum sfz)
   #+END_SRC
   Keynum of sfz instance in Midicents, setfable.
*** Arguments
    =sfz= Instance of class sfz.
*** See also
    - [[sfz][sfz]]
** sfz-pan
   Function
   #+BEGIN_SRC lisp
     (sfz-pan sfz)
   #+END_SRC
   Equal power panning of sfz instance in the range /[0..1]/,
   setfable.
*** Arguments
    =sfz= Instance of class sfz.
*** See also
    - [[sfz][sfz]]
** sfz-preset-file
   Function
   #+BEGIN_SRC lisp
     (sfz-preset-file preset)
   #+END_SRC
   Return the full path of /preset/.
*** Arguments
    =preset= Keyword or symbol of a registered sfz preset.
*** See also<:
    - [[add-sfz-preset][add-sfz-preset]]
** sfz-preset-loaded?
   Function
   #+BEGIN_SRC lisp
     (sfz-preset-loaded? preset)
   #+END_SRC

   Predicate to test if sfz preset is loaded.
*** Arguments
    =preset= Keyword or symbol of registered preset.
*** Examples:
    #+BEGIN_SRC lisp
      ;;; Directly after Clamps startup:

      (sfz-preset-loaded? :flute-nv) ;; => nil

      (output (new sfz))
      ;; => loading :flute-nv from ~/quicklisp/local-procects/clamps/extra/snd/sfz/Flute-nv/000_Flute-nv.sfz
      ;; No values

      (sfz-preset-loaded? :flute-nv) ;; => t
    #+END_SRC
*** See also
    - [[add-sfz-preset][add-sfz-preset]]

    - [[get-sfz-preset][get-sfz-preset]]
** sfz-play-fn
   Function
   #+BEGIN_SRC lisp
     (sfz-play-fn sfz)
   #+END_SRC
   Play function of sfz instance, setfable.
*** Arguments
    =sfz= Instance of class sfz.
*** See also
    - [[sfz][sfz]]
