doc/clamps-dictionary.html
<div id="outline-container-org0f0ee37" class="outline-4">
<h4 id="org0f0ee37">Examples:</h4>
<div class="outline-text-4" id="text-org0f0ee37">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>new sfz<span style="color: #ffff00;">)</span>
<span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; #i(sfz keynum 60 amplitude 1 duration 1 preset :flute-nv</span>
<span style="color: #add8e6;">;;           </span><span style="color: #add8e6;">play-fn nil pan 0.5 startpos 0 chan 100)</span>

<span style="color: #add8e6;">;; </span><span style="color: #add8e6;">the following code should send 1 second of a flute middle C sound</span>
<span style="color: #add8e6;">;; </span><span style="color: #add8e6;">to the first two oulets of incudine:</span>

<span style="color: #ffff00;">(</span>output <span style="color: #a9a9a9;">(</span>new sfz<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span> <span style="color: #add8e6;">; =&gt; ; No value</span>

<span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; loading :flute-nv from ~/quicklisp/local-projects/clamps/extra/snd/sfz/Flute-nv/000_Flute-nv.sfz</span>
<span style="color: #add8e6;">;; </span><span style="color: #add8e6;">; No values</span>

<span style="color: #ffff00;">(</span><span style="color: #afeeee; font-weight: bold;">loop</span>
  for idx below 200
  for x = <span style="color: #a9a9a9;">(</span>/ idx 199<span style="color: #a9a9a9;">)</span>
  for time = 0 then <span style="color: #a9a9a9;">(</span>+ time <span style="color: #ff1493;">(</span>n-exp <span style="color: #adff2f;">(</span>interp x 0 0  0.3 1  1 0<span style="color: #adff2f;">)</span> 0.01 0.1<span style="color: #ff1493;">)</span><span style="color: #a9a9a9;">)</span>
  do <span style="color: #a9a9a9;">(</span>sprout
      <span style="color: #ff1493;">(</span>new sfz
        <span style="color: #7fffd4;">:time</span> time
        <span style="color: #7fffd4;">:keynum</span> <span style="color: #adff2f;">(</span>+ 65.5 <span style="color: #00bfff;">(</span>random <span style="color: #ffff00;">(</span>n-lin <span style="color: #cdad00;">(</span>interp x 0 0 1 1<span style="color: #cdad00;">)</span> 1 5<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #adff2f;">)</span>
        <span style="color: #7fffd4;">:duration</span> <span style="color: #adff2f;">(</span>+ 0.5 <span style="color: #00bfff;">(</span>random 2.0<span style="color: #00bfff;">)</span><span style="color: #adff2f;">)</span>
        <span style="color: #7fffd4;">:amplitude</span> <span style="color: #adff2f;">(</span>n-lin <span style="color: #00bfff;">(</span>interp x 0 0 0.8 0 1 1<span style="color: #00bfff;">)</span> -12 -24<span style="color: #adff2f;">)</span><span style="color: #ff1493;">)</span><span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>

<span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; nil</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2238535" class="outline-4">
<h4 id="org2238535">See also</h4>
<div class="outline-text-4" id="text-org2238535">
<ul class="org-ul">
<li><a href="#org1ea3aae">add-sfz-preset</a></li>

<li><a href="#orgc3ef1fd">lsample</a></li>

<li><a href="#orgd08b988">play-sfz-loop</a></li>

<li><a href="#org868f855">play-sfz-one-shot</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbb9b648" class="outline-3">
<h3 id="orgbb9b648">sfz-amplitude</h3>
<div class="outline-text-3" id="text-orgbb9b648">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-amplitude sfz<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Amplitude of sfz instance in dB, setfable.
</p>
</div>
<div id="outline-container-orgfef1755" class="outline-4">
<h4 id="orgfef1755">Arguments</h4>
<div class="outline-text-4" id="text-orgfef1755">
<p>
<code>sfz</code> Instance of class sfz.
</p>
</div>
</div>
<div id="outline-container-orgc54fb8a" class="outline-4">
<h4 id="orgc54fb8a">See also</h4>
<div class="outline-text-4" id="text-orgc54fb8a">
<ul class="org-ul">
<li><a href="#orgf99d308">sfz</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5accb28" class="outline-3">
<h3 id="org5accb28">sfz-chan</h3>
<div class="outline-text-3" id="text-org5accb28">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-channel sfz<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Channel of sfz instance, setfable.
</p>
</div>
<div id="outline-container-orgcbae37b" class="outline-4">
<h4 id="orgcbae37b">Arguments</h4>
<div class="outline-text-4" id="text-orgcbae37b">
<p>
<code>sfz</code> Instance of class sfz.
</p>
</div>
</div>
<div id="outline-container-orgd5f0c2a" class="outline-4">
<h4 id="orgd5f0c2a">See also</h4>
<div class="outline-text-4" id="text-orgd5f0c2a">
<ul class="org-ul">
<li><a href="#orgf99d308">sfz</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0133edc" class="outline-3">
<h3 id="org0133edc">sfz-duration</h3>
<div class="outline-text-3" id="text-org0133edc">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-duration sfz<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Duration of sfz instance in seconds, setfable.
</p>
</div>
<div id="outline-container-orgf719eab" class="outline-4">
<h4 id="orgf719eab">Arguments</h4>
<div class="outline-text-4" id="text-orgf719eab">
<p>
<code>sfz</code> Instance of class sfz.
</p>
</div>
</div>
<div id="outline-container-org41a16dc" class="outline-4">
<h4 id="org41a16dc">See also</h4>
<div class="outline-text-4" id="text-org41a16dc">
<ul class="org-ul">
<li><a href="#orgf99d308">sfz</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7191415" class="outline-3">
<h3 id="org7191415">sfz-get-range</h3>
<div class="outline-text-3" id="text-org7191415">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-get-range ref<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the keynum range of sfz denoted by <i>ref</i>.
</p>
</div>
<div id="outline-container-orgcfc951d" class="outline-4">
<h4 id="orgcfc951d">Arguments</h4>
<div class="outline-text-4" id="text-orgcfc951d">
<p>
<code>ref</code> Reference to the sfz. Can be the <i>keyword</i> or <i>symbol</i> of a
registered sfz preset or a filename (pathname or string) of a sfz
file. Relative filenames will be searched recursively in
<i>&lowast;sfz-file-path&lowast;</i>.
</p>
</div>
</div>
<div id="outline-container-org48169c4" class="outline-4">
<h4 id="org48169c4">See also</h4>
<div class="outline-text-4" id="text-org48169c4">
<ul class="org-ul">
<li><a href="#org1ea3aae">add-sfz-preset</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6f2e6c0" class="outline-3">
<h3 id="org6f2e6c0">sfz-keynum</h3>
<div class="outline-text-3" id="text-org6f2e6c0">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-keynum sfz<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Keynum of sfz instance in Midicents, setfable.
</p>
</div>
<div id="outline-container-org96f4a80" class="outline-4">
<h4 id="org96f4a80">Arguments</h4>
<div class="outline-text-4" id="text-org96f4a80">
<p>
<code>sfz</code> Instance of class sfz.
</p>
</div>
</div>
<div id="outline-container-org0761f25" class="outline-4">
<h4 id="org0761f25">See also</h4>
<div class="outline-text-4" id="text-org0761f25">
<ul class="org-ul">
<li><a href="#orgf99d308">sfz</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc0e83d7" class="outline-3">
<h3 id="orgc0e83d7">sfz-pan</h3>
<div class="outline-text-3" id="text-orgc0e83d7">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-pan sfz<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Equal power panning of sfz instance in the range <i>[0..1]</i>,
setfable.
</p>
</div>
<div id="outline-container-org8113345" class="outline-4">
<h4 id="org8113345">Arguments</h4>
<div class="outline-text-4" id="text-org8113345">
<p>
<code>sfz</code> Instance of class sfz.
</p>
</div>
</div>
<div id="outline-container-org885f86d" class="outline-4">
<h4 id="org885f86d">See also</h4>
<div class="outline-text-4" id="text-org885f86d">
<ul class="org-ul">
<li><a href="#orgf99d308">sfz</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3f64d52" class="outline-3">
<h3 id="org3f64d52">sfz-preset-file</h3>
<div class="outline-text-3" id="text-org3f64d52">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-preset-file preset<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the full path of <i>preset</i>.
</p>
</div>
<div id="outline-container-orga3128c7" class="outline-4">
<h4 id="orga3128c7">Arguments</h4>
<div class="outline-text-4" id="text-orga3128c7">
<p>
<code>preset</code> Keyword or symbol of a registered sfz preset.
</p>
</div>
</div>
<div id="outline-container-org2abb93a" class="outline-4">
<h4 id="org2abb93a">See also&lt;:</h4>
<div class="outline-text-4" id="text-org2abb93a">
<ul class="org-ul">
<li><a href="#org1ea3aae">add-sfz-preset</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org01b0ffb" class="outline-3">
<h3 id="org01b0ffb">sfz-preset-loaded?</h3>
<div class="outline-text-3" id="text-org01b0ffb">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-preset-loaded? preset<span style="color: #ffff00;">)</span>
</pre>
</div>

<p>
Predicate to test if sfz preset is loaded.
</p>
</div>
<div id="outline-container-org6176917" class="outline-4">
<h4 id="org6176917">Arguments</h4>
<div class="outline-text-4" id="text-org6176917">
<p>
<code>preset</code> Keyword or symbol of registered preset.
</p>
</div>
</div>
<div id="outline-container-org2d70dd9" class="outline-4">
<h4 id="org2d70dd9">Examples:</h4>
<div class="outline-text-4" id="text-org2d70dd9">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #add8e6;">;;; </span><span style="color: #add8e6;">Directly after Clamps startup:</span>

<span style="color: #ffff00;">(</span>sfz-preset-loaded? <span style="color: #7fffd4;">:flute-nv</span><span style="color: #ffff00;">)</span> <span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; nil</span>

<span style="color: #ffff00;">(</span>output <span style="color: #a9a9a9;">(</span>new sfz<span style="color: #a9a9a9;">)</span><span style="color: #ffff00;">)</span>
<span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; loading :flute-nv from ~/quicklisp/local-procects/clamps/extra/snd/sfz/Flute-nv/000_Flute-nv.sfz</span>
<span style="color: #add8e6;">;; </span><span style="color: #add8e6;">No values</span>

<span style="color: #ffff00;">(</span>sfz-preset-loaded? <span style="color: #7fffd4;">:flute-nv</span><span style="color: #ffff00;">)</span> <span style="color: #add8e6;">;; </span><span style="color: #add8e6;">=&gt; t</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1d8086e" class="outline-4">
<h4 id="org1d8086e">See also</h4>
<div class="outline-text-4" id="text-org1d8086e">
<ul class="org-ul">
<li><a href="#org1ea3aae">add-sfz-preset</a></li>

<li><a href="#org86aa2cb">get-sfz-preset</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org20ee4a6" class="outline-3">
<h3 id="org20ee4a6">sfz-play-fn</h3>
<div class="outline-text-3" id="text-org20ee4a6">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-play-fn sfz<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Play function of sfz instance, setfable.
</p>
</div>
