doc/clamps-dictionary.org
** sfz-preset
   Function
   #+BEGIN_SRC lisp
     (sfz-preset sfz)
   #+END_SRC
   Preset of sfz instance, setfable.
*** Arguments
    =sfz= Instance of class sfz.
*** See also
    - [[sfz][sfz]]
** sfz-startpos
   Function
   #+BEGIN_SRC lisp
     (sfz-startpos sfz)
   #+END_SRC
   Start position of sfz instance in seconds, setfable.
*** Arguments
    =sfz= Instance of class sfz.
*** See also
    - [[sfz][sfz]]
** \ast{}standard-pitch\ast{}
   Variable

   The tuning reference for /ftom/ and /mtof/ in Hz. Defaults to /440/.
*** Important Note:

Don't set this value directly! Rather use the [[set-standard-pitch][set-standard-pitch]]
function which changes the standard pitch reference for the entire
/Clamps/ system.
*** See also
    - [[ftom][ftom]]

    - [[mtof][mtof]]

    - [[set-standard-pitch][set-standard-pitch]]
** start-doc-acceptor
Function
   #+Begin_src lisp
     (start-doc-acceptor)
   #+End_src
   Start the doc acceptor for online documentation. This is done
   automatically on startup to make the clamps documentation
   accessible at the URL /https://localhost:8282/.
*** See also
** svg
   Class
** svg->browser
   Function
   #+BEGIN_SRC lisp
   (svg->browser svg-file)
   #+END_SRC
   Display =svg-file= in the SVG Player Gui, located at
    /<clamps-base-url>/svg-display/.
*** Arguments
    =svg-file= String naming the svg-file to display/play. The
    filename is interpreted relative to the /<clamps-gui-root>/svg/
    directory.
** svg-gui-path
Function
   #+Begin_src lisp
     (svg-gui-path file)
   #+End_src
   Return the full path of SVG file /file/ in the current GUI.
*** Arguments
    =file= A String designating the filename of the SVG file.
*** See also
    - [[clamps-gui-root][clamps-gui-root]]

* W - Z
** watch
   Function
   #+BEGIN_SRC lisp
     (watch fn)
   #+END_SRC
   Call /fn/ whenever a value accessed using [[get-val][get-val]] in the body of
   the function is changed.

   /watch/ returns a function to remove the relation, /watch/ has
   established. Refer to the chapter /Clamps Packages/Misc
   Packages/cl-refs/ in the [[../clamps/index.html][Clamps]] documentation for examples.
*** Arguments
    =fn= Function of no arguments to call
*** See also
    - [[get-val][get-val]]

    - [[make-computed][make-computed]]

    - [[make-ref][make-ref]]

    - [[set-val][set-val]]
   

* TODO
