doc/clamps-dictionary.html
<div id="outline-container-org9dc7ed4" class="outline-4">
<h4 id="org9dc7ed4">Arguments</h4>
<div class="outline-text-4" id="text-org9dc7ed4">
<p>
<code>sfz</code> Instance of class sfz.
</p>
</div>
</div>
<div id="outline-container-org8be3626" class="outline-4">
<h4 id="org8be3626">See also</h4>
<div class="outline-text-4" id="text-org8be3626">
<ul class="org-ul">
<li><a href="#orgf99d308">sfz</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4973f5f" class="outline-3">
<h3 id="org4973f5f">sfz-preset</h3>
<div class="outline-text-3" id="text-org4973f5f">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-preset sfz<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Preset of sfz instance, setfable.
</p>
</div>
<div id="outline-container-orgec798c8" class="outline-4">
<h4 id="orgec798c8">Arguments</h4>
<div class="outline-text-4" id="text-orgec798c8">
<p>
<code>sfz</code> Instance of class sfz.
</p>
</div>
</div>
<div id="outline-container-org5e8920b" class="outline-4">
<h4 id="org5e8920b">See also</h4>
<div class="outline-text-4" id="text-org5e8920b">
<ul class="org-ul">
<li><a href="#orgf99d308">sfz</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc115799" class="outline-3">
<h3 id="orgc115799">sfz-startpos</h3>
<div class="outline-text-3" id="text-orgc115799">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>sfz-startpos sfz<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Start position of sfz instance in seconds, setfable.
</p>
</div>
<div id="outline-container-org6f4381a" class="outline-4">
<h4 id="org6f4381a">Arguments</h4>
<div class="outline-text-4" id="text-org6f4381a">
<p>
<code>sfz</code> Instance of class sfz.
</p>
</div>
</div>
<div id="outline-container-org8aa43fa" class="outline-4">
<h4 id="org8aa43fa">See also</h4>
<div class="outline-text-4" id="text-org8aa43fa">
<ul class="org-ul">
<li><a href="#orgf99d308">sfz</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4ee3faa" class="outline-3">
<h3 id="org4ee3faa">&lowast;standard-pitch&lowast;</h3>
<div class="outline-text-3" id="text-org4ee3faa">
<p>
Variable
</p>

<p>
The tuning reference for <i>ftom</i> and <i>mtof</i> in Hz. Defaults to <i>440</i>.
</p>
</div>
<div id="outline-container-org892d516" class="outline-4">
<h4 id="org892d516">Important Note:</h4>
<div class="outline-text-4" id="text-org892d516">
<p>
Don't set this value directly! Rather use the <a href="#orgbf5bd77">set-standard-pitch</a>
function which changes the standard pitch reference for the entire
<i>Clamps</i> system.
</p>
</div>
</div>
<div id="outline-container-orgcc8be55" class="outline-4">
<h4 id="orgcc8be55">See also</h4>
<div class="outline-text-4" id="text-orgcc8be55">
<ul class="org-ul">
<li><a href="#org3ecc4e8">ftom</a></li>

<li><a href="#org41aca11">mtof</a></li>

<li><a href="#orgbf5bd77">set-standard-pitch</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org669127c" class="outline-3">
<h3 id="org669127c">start-doc-acceptor</h3>
<div class="outline-text-3" id="text-org669127c">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>start-doc-acceptor<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Start the doc acceptor for online documentation. This is done
automatically on startup to make the clamps documentation
accessible at the URL <i><a href="https://localhost:8282">https://localhost:8282</a></i>.
</p>
</div>
<div id="outline-container-orge75784c" class="outline-4">
<h4 id="orge75784c">See also</h4>
</div>
</div>
<div id="outline-container-org6599126" class="outline-3">
<h3 id="org6599126">svg</h3>
<div class="outline-text-3" id="text-org6599126">
<p>
Class
</p>
</div>
</div>
<div id="outline-container-orge98d1d5" class="outline-3">
<h3 id="orge98d1d5">svg-&gt;browser</h3>
<div class="outline-text-3" id="text-orge98d1d5">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>svg-&gt;browser svg-file<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Display <code>svg-file</code> in the SVG Player Gui, located at
 <i>&lt;clamps-base-url&gt;/svg-display</i>.
</p>
</div>
<div id="outline-container-org5b6ceeb" class="outline-4">
<h4 id="org5b6ceeb">Arguments</h4>
<div class="outline-text-4" id="text-org5b6ceeb">
<p>
<code>svg-file</code> String naming the svg-file to display/play. The
filename is interpreted relative to the <i>&lt;clamps-gui-root&gt;/svg</i>
directory.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf2ea187" class="outline-3">
<h3 id="orgf2ea187">svg-gui-path</h3>
<div class="outline-text-3" id="text-orgf2ea187">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>svg-gui-path file<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Return the full path of SVG file <i>file</i> in the current GUI.
</p>
</div>
<div id="outline-container-org1072d11" class="outline-4">
<h4 id="org1072d11">Arguments</h4>
<div class="outline-text-4" id="text-org1072d11">
<p>
<code>file</code> A String designating the filename of the SVG file.
</p>
</div>
</div>
<div id="outline-container-org90b03bd" class="outline-4">
<h4 id="org90b03bd">See also</h4>
<div class="outline-text-4" id="text-org90b03bd">
<ul class="org-ul">
<li><a href="#org3c1d1a7">clamps-gui-root</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf1e5cfb" class="outline-2">
<h2 id="orgf1e5cfb">W - Z</h2>
<div class="outline-text-2" id="text-orgf1e5cfb">
</div>
<div id="outline-container-org1d9cbb3" class="outline-3">
<h3 id="org1d9cbb3">watch</h3>
<div class="outline-text-3" id="text-org1d9cbb3">
<p>
Function
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #ffff00;">(</span>watch fn<span style="color: #ffff00;">)</span>
</pre>
</div>
<p>
Call <i>fn</i> whenever a value accessed using <a href="#org30f229f">get-val</a> in the body of
the function is changed.
</p>

<p>
<i>watch</i> returns a function to remove the relation, <i>watch</i> has
established. Refer to the chapter <i>Clamps Packages/Misc
Packages/cl-refs</i> in the <a href="../clamps/index.html">Clamps</a> documentation for examples.
</p>
</div>
<div id="outline-container-orgfc6b09c" class="outline-4">
<h4 id="orgfc6b09c">Arguments</h4>
<div class="outline-text-4" id="text-orgfc6b09c">
<p>
<code>fn</code> Function of no arguments to call
</p>
</div>
</div>
<div id="outline-container-org06ad5a0" class="outline-4">
<h4 id="org06ad5a0">See also</h4>
<div class="outline-text-4" id="text-org06ad5a0">
<ul class="org-ul">
<li><a href="#org30f229f">get-val</a></li>

<li><a href="#orgd23f998">make-computed</a></li>

<li><a href="#orgf28e231">make-ref</a></li>

<li><a href="#org4b2eaca">set-val</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org8dde590" class="outline-2">
<h2 id="org8dde590"><span class="todo TODO">TODO</span> </h2>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">See <i>ChannelModeMessages</i> on <a href="https://midi.org/summary-of-midi-1-0-messages">this page</a>.</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Orm Finnendahl</p>
<p class="date">Created: 2024-08-21 Mi 11:17</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
